betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/*******************  Bit definition for ADC_CTRL2 register  ********************/
#define ADC_CTRL2_ADCEN_Pos                                         (0U)
#define ADC_CTRL2_ADCEN_Msk                                         (0x1UL << ADC_CTRL2_ADCEN_Pos)                                 /*!< 0x00000001 */
#define ADC_CTRL2_ADCEN                                             ADC_CTRL2_ADCEN_Msk                                            /*!<A/D Converter ON / OFF */
#define ADC_CTRL2_CONTCEN_Pos                                       (1U)
#define ADC_CTRL2_CONTCEN_Msk                                       (0x1UL << ADC_CTRL2_CONTCEN_Pos)                               /*!< 0x00000002 */
#define ADC_CTRL2_CONTCEN                                           ADC_CTRL2_CONTCEN_Msk                                          /*!<Continuous Conversion */
#define ADC_CTRL2_DMAEN_Pos                                         (8U)
#define ADC_CTRL2_DMAEN_Msk                                         (0x1UL << ADC_CTRL2_DMAEN_Pos)                                 /*!< 0x00000100 */
#define ADC_CTRL2_DMAEN                                             ADC_CTRL2_DMAEN_Msk                                            /*!<Direct Memory access mode */
#define ADC_CTRL2_DMADISSEL_Pos                                     (9U)
#define ADC_CTRL2_DMADISSEL_Msk                                     (0x1UL << ADC_CTRL2_DMADISSEL_Pos)                             /*!< 0x00000200 */
#define ADC_CTRL2_DMADISSEL                                         ADC_CTRL2_DMADISSEL_Msk                                        /*!<DMA disable selection (Single ADC) */
#define ADC_CTRL2_EOCSEL_Pos                                        (10U)
#define ADC_CTRL2_EOCSEL_Msk                                        (0x1UL << ADC_CTRL2_EOCSEL_Pos)                                /*!< 0x00000400 */
#define ADC_CTRL2_EOCSEL                                            ADC_CTRL2_EOCSEL_Msk                                           /*!<End of conversion selection */
#define ADC_CTRL2_DALIGNCFG_Pos                                     (11U)
#define ADC_CTRL2_DALIGNCFG_Msk                                     (0x1UL << ADC_CTRL2_DALIGNCFG_Pos)                             /*!< 0x00000800 */
#define ADC_CTRL2_DALIGNCFG                                         ADC_CTRL2_DALIGNCFG_Msk                                        /*!<Data Alignment */
#define ADC_CTRL2_INJGEXTTRGSEL_Pos                                 (16U)
#define ADC_CTRL2_INJGEXTTRGSEL_Msk                                 (0xFUL << ADC_CTRL2_INJGEXTTRGSEL_Pos)                         /*!< 0x000F0000 */
#define ADC_CTRL2_INJGEXTTRGSEL                                     ADC_CTRL2_INJGEXTTRGSEL_Msk                                    /*!<JEXTSEL[3:0] bits (External event select for injected group) */
#define ADC_CTRL2_INJGEXTTRGSEL_0                                   (0x1UL << ADC_CTRL2_INJGEXTTRGSEL_Pos)                         /*!< 0x00010000 */
#define ADC_CTRL2_INJGEXTTRGSEL_1                                   (0x2UL << ADC_CTRL2_INJGEXTTRGSEL_Pos)                         /*!< 0x00020000 */
#define ADC_CTRL2_INJGEXTTRGSEL_2                                   (0x4UL << ADC_CTRL2_INJGEXTTRGSEL_Pos)                         /*!< 0x00040000 */
#define ADC_CTRL2_INJGEXTTRGSEL_3                                   (0x8UL << ADC_CTRL2_INJGEXTTRGSEL_Pos)                         /*!< 0x00080000 */
#define ADC_CTRL2_INJEXTTRGEN_Pos                                   (20U)
#define ADC_CTRL2_INJEXTTRGEN_Msk                                   (0x3UL << ADC_CTRL2_INJEXTTRGEN_Pos)                           /*!< 0x00300000 */
#define ADC_CTRL2_INJEXTTRGEN                                       ADC_CTRL2_INJEXTTRGEN_Msk                                      /*!<JEXTEN[1:0] bits (External Trigger Conversion mode for injected channelsp) */
#define ADC_CTRL2_INJEXTTRGEN_0                                     (0x1UL << ADC_CTRL2_INJEXTTRGEN_Pos)                           /*!< 0x00100000 */
#define ADC_CTRL2_INJEXTTRGEN_1                                     (0x2UL << ADC_CTRL2_INJEXTTRGEN_Pos)                           /*!< 0x00200000 */
#define ADC_CTRL2_INJSWSC_Pos                                       (22U)
#define ADC_CTRL2_INJSWSC_Msk                                       (0x1UL << ADC_CTRL2_INJSWSC_Pos)                               /*!< 0x00400000 */
#define ADC_CTRL2_INJSWSC                                           ADC_CTRL2_INJSWSC_Msk                                          /*!<Start Conversion of injected channels */
#define ADC_CTRL2_REGEXTTRGSEL_Pos                                  (24U)
#define ADC_CTRL2_REGEXTTRGSEL_Msk                                  (0xFUL << ADC_CTRL2_REGEXTTRGSEL_Pos)                          /*!< 0x0F000000 */
#define ADC_CTRL2_REGEXTTRGSEL                                      ADC_CTRL2_REGEXTTRGSEL_Msk                                     /*!<EXTSEL[3:0] bits (External Event Select for regular group) */
#define ADC_CTRL2_REGEXTTRGSEL_0                                    (0x1UL << ADC_CTRL2_REGEXTTRGSEL_Pos)                          /*!< 0x01000000 */
#define ADC_CTRL2_REGEXTTRGSEL_1                                    (0x2UL << ADC_CTRL2_REGEXTTRGSEL_Pos)                          /*!< 0x02000000 */
#define ADC_CTRL2_REGEXTTRGSEL_2                                    (0x4UL << ADC_CTRL2_REGEXTTRGSEL_Pos)                          /*!< 0x04000000 */
#define ADC_CTRL2_REGEXTTRGSEL_3                                    (0x8UL << ADC_CTRL2_REGEXTTRGSEL_Pos)                          /*!< 0x08000000 */
#define ADC_CTRL2_REGEXTTRGEN_Pos                                   (28U)
#define ADC_CTRL2_REGEXTTRGEN_Msk                                   (0x3UL << ADC_CTRL2_REGEXTTRGEN_Pos)                           /*!< 0x30000000 */
#define ADC_CTRL2_REGEXTTRGEN                                       ADC_CTRL2_REGEXTTRGEN_Msk                                      /*!<EXTEN[1:0] bits (External Trigger Conversion mode for regular channelsp) */
#define ADC_CTRL2_REGEXTTRGEN_0                                     (0x1UL << ADC_CTRL2_REGEXTTRGEN_Pos)                           /*!< 0x10000000 */
#define ADC_CTRL2_REGEXTTRGEN_1                                     (0x2UL << ADC_CTRL2_REGEXTTRGEN_Pos)                           /*!< 0x20000000 */
#define ADC_CTRL2_REGSWSC_Pos                                       (30U)
#define ADC_CTRL2_REGSWSC_Msk                                       (0x1UL << ADC_CTRL2_REGSWSC_Pos)                               /*!< 0x40000000 */
#define ADC_CTRL2_REGSWSC                                           ADC_CTRL2_REGSWSC_Msk                                          /*!<Start Conversion of regular channels */

/******************  Bit definition for ADC_SMPTIM1 register  *******************/
#define ADC_SMPTIM1_SMPCYCCFG10_Pos                                 (0U)
#define ADC_SMPTIM1_SMPCYCCFG10_Msk                                 (0x7UL << ADC_SMPTIM1_SMPCYCCFG10_Pos)                         /*!< 0x00000007 */
#define ADC_SMPTIM1_SMPCYCCFG10                                     ADC_SMPTIM1_SMPCYCCFG10_Msk                                    /*!<SMP10[2:0] bits (Channel 10 Sample time selection) */
#define ADC_SMPTIM1_SMPCYCCFG10_0                                   (0x1UL << ADC_SMPTIM1_SMPCYCCFG10_Pos)                         /*!< 0x00000001 */
#define ADC_SMPTIM1_SMPCYCCFG10_1                                   (0x2UL << ADC_SMPTIM1_SMPCYCCFG10_Pos)                         /*!< 0x00000002 */
#define ADC_SMPTIM1_SMPCYCCFG10_2                                   (0x4UL << ADC_SMPTIM1_SMPCYCCFG10_Pos)                         /*!< 0x00000004 */
#define ADC_SMPTIM1_SMPCYCCFG11_Pos                                 (3U)
#define ADC_SMPTIM1_SMPCYCCFG11_Msk                                 (0x7UL << ADC_SMPTIM1_SMPCYCCFG11_Pos)                         /*!< 0x00000038 */
#define ADC_SMPTIM1_SMPCYCCFG11                                     ADC_SMPTIM1_SMPCYCCFG11_Msk                                    /*!<SMP11[2:0] bits (Channel 11 Sample time selection) */
#define ADC_SMPTIM1_SMPCYCCFG11_0                                   (0x1UL << ADC_SMPTIM1_SMPCYCCFG11_Pos)                         /*!< 0x00000008 */
#define ADC_SMPTIM1_SMPCYCCFG11_1                                   (0x2UL << ADC_SMPTIM1_SMPCYCCFG11_Pos)                         /*!< 0x00000010 */
#define ADC_SMPTIM1_SMPCYCCFG11_2                                   (0x4UL << ADC_SMPTIM1_SMPCYCCFG11_Pos)                         /*!< 0x00000020 */
#define ADC_SMPTIM1_SMPCYCCFG12_Pos                                 (6U)
#define ADC_SMPTIM1_SMPCYCCFG12_Msk                                 (0x7UL << ADC_SMPTIM1_SMPCYCCFG12_Pos)                         /*!< 0x000001C0 */
#define ADC_SMPTIM1_SMPCYCCFG12                                     ADC_SMPTIM1_SMPCYCCFG12_Msk                                    /*!<SMP12[2:0] bits (Channel 12 Sample time selection) */
#define ADC_SMPTIM1_SMPCYCCFG12_0                                   (0x1UL << ADC_SMPTIM1_SMPCYCCFG12_Pos)                         /*!< 0x00000040 */
#define ADC_SMPTIM1_SMPCYCCFG12_1                                   (0x2UL << ADC_SMPTIM1_SMPCYCCFG12_Pos)                         /*!< 0x00000080 */
#define ADC_SMPTIM1_SMPCYCCFG12_2                                   (0x4UL << ADC_SMPTIM1_SMPCYCCFG12_Pos)                         /*!< 0x00000100 */
#define ADC_SMPTIM1_SMPCYCCFG13_Pos                                 (9U)
#define ADC_SMPTIM1_SMPCYCCFG13_Msk                                 (0x7UL << ADC_SMPTIM1_SMPCYCCFG13_Pos)                         /*!< 0x00000E00 */
#define ADC_SMPTIM1_SMPCYCCFG13                                     ADC_SMPTIM1_SMPCYCCFG13_Msk                                    /*!<SMP13[2:0] bits (Channel 13 Sample time selection) */
#define ADC_SMPTIM1_SMPCYCCFG13_0                                   (0x1UL << ADC_SMPTIM1_SMPCYCCFG13_Pos)                         /*!< 0x00000200 */
#define ADC_SMPTIM1_SMPCYCCFG13_1                                   (0x2UL << ADC_SMPTIM1_SMPCYCCFG13_Pos)                         /*!< 0x00000400 */
#define ADC_SMPTIM1_SMPCYCCFG13_2                                   (0x4UL << ADC_SMPTIM1_SMPCYCCFG13_Pos)                         /*!< 0x00000800 */
#define ADC_SMPTIM1_SMPCYCCFG14_Pos                                 (12U)
#define ADC_SMPTIM1_SMPCYCCFG14_Msk                                 (0x7UL << ADC_SMPTIM1_SMPCYCCFG14_Pos)                         /*!< 0x00007000 */
#define ADC_SMPTIM1_SMPCYCCFG14                                     ADC_SMPTIM1_SMPCYCCFG14_Msk                                    /*!<SMP14[2:0] bits (Channel 14 Sample time selection) */
#define ADC_SMPTIM1_SMPCYCCFG14_0                                   (0x1UL << ADC_SMPTIM1_SMPCYCCFG14_Pos)                         /*!< 0x00001000 */
#define ADC_SMPTIM1_SMPCYCCFG14_1                                   (0x2UL << ADC_SMPTIM1_SMPCYCCFG14_Pos)                         /*!< 0x00002000 */
#define ADC_SMPTIM1_SMPCYCCFG14_2                                   (0x4UL << ADC_SMPTIM1_SMPCYCCFG14_Pos)                         /*!< 0x00004000 */
#define ADC_SMPTIM1_SMPCYCCFG15_Pos                                 (15U)
#define ADC_SMPTIM1_SMPCYCCFG15_Msk                                 (0x7UL << ADC_SMPTIM1_SMPCYCCFG15_Pos)                         /*!< 0x00038000 */
#define ADC_SMPTIM1_SMPCYCCFG15                                     ADC_SMPTIM1_SMPCYCCFG15_Msk                                    /*!<SMP15[2:0] bits (Channel 15 Sample time selection) */
#define ADC_SMPTIM1_SMPCYCCFG15_0                                   (0x1UL << ADC_SMPTIM1_SMPCYCCFG15_Pos)                         /*!< 0x00008000 */
#define ADC_SMPTIM1_SMPCYCCFG15_1                                   (0x2UL << ADC_SMPTIM1_SMPCYCCFG15_Pos)                         /*!< 0x00010000 */
#define ADC_SMPTIM1_SMPCYCCFG15_2                                   (0x4UL << ADC_SMPTIM1_SMPCYCCFG15_Pos)                         /*!< 0x00020000 */
#define ADC_SMPTIM1_SMPCYCCFG16_Pos                                 (18U)
#define ADC_SMPTIM1_SMPCYCCFG16_Msk                                 (0x7UL << ADC_SMPTIM1_SMPCYCCFG16_Pos)                         /*!< 0x001C0000 */
#define ADC_SMPTIM1_SMPCYCCFG16                                     ADC_SMPTIM1_SMPCYCCFG16_Msk                                    /*!<SMP16[2:0] bits (Channel 16 Sample time selection) */
#define ADC_SMPTIM1_SMPCYCCFG16_0                                   (0x1UL << ADC_SMPTIM1_SMPCYCCFG16_Pos)                         /*!< 0x00040000 */
#define ADC_SMPTIM1_SMPCYCCFG16_1                                   (0x2UL << ADC_SMPTIM1_SMPCYCCFG16_Pos)                         /*!< 0x00080000 */
#define ADC_SMPTIM1_SMPCYCCFG16_2                                   (0x4UL << ADC_SMPTIM1_SMPCYCCFG16_Pos)                         /*!< 0x00100000 */
#define ADC_SMPTIM1_SMPCYCCFG17_Pos                                 (21U)
#define ADC_SMPTIM1_SMPCYCCFG17_Msk                                 (0x7UL << ADC_SMPTIM1_SMPCYCCFG17_Pos)                         /*!< 0x00E00000 */
#define ADC_SMPTIM1_SMPCYCCFG17                                     ADC_SMPTIM1_SMPCYCCFG17_Msk                                    /*!<SMP17[2:0] bits (Channel 17 Sample time selection) */
#define ADC_SMPTIM1_SMPCYCCFG17_0                                   (0x1UL << ADC_SMPTIM1_SMPCYCCFG17_Pos)                         /*!< 0x00200000 */
#define ADC_SMPTIM1_SMPCYCCFG17_1                                   (0x2UL << ADC_SMPTIM1_SMPCYCCFG17_Pos)                         /*!< 0x00400000 */
#define ADC_SMPTIM1_SMPCYCCFG17_2                                   (0x4UL << ADC_SMPTIM1_SMPCYCCFG17_Pos)                         /*!< 0x00800000 */
#define ADC_SMPTIM1_SMPCYCCFG18_Pos                                 (24U)
#define ADC_SMPTIM1_SMPCYCCFG18_Msk                                 (0x7UL << ADC_SMPTIM1_SMPCYCCFG18_Pos)                         /*!< 0x07000000 */
#define ADC_SMPTIM1_SMPCYCCFG18                                     ADC_SMPTIM1_SMPCYCCFG18_Msk                                    /*!<SMP18[2:0] bits (Channel 18 Sample time selection) */
#define ADC_SMPTIM1_SMPCYCCFG18_0                                   (0x1UL << ADC_SMPTIM1_SMPCYCCFG18_Pos)                         /*!< 0x01000000 */
#define ADC_SMPTIM1_SMPCYCCFG18_1                                   (0x2UL << ADC_SMPTIM1_SMPCYCCFG18_Pos)                         /*!< 0x02000000 */
#define ADC_SMPTIM1_SMPCYCCFG18_2                                   (0x4UL << ADC_SMPTIM1_SMPCYCCFG18_Pos)                         /*!< 0x04000000 */

