betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/******************  Bit definition for ADC_INJDOF2 register  *******************/
#define ADC_INJDOF2_INJDOF2_Pos                                     (0U)
#define ADC_INJDOF2_INJDOF2_Msk                                     (0xFFFUL << ADC_INJDOF2_INJDOF2_Pos)                           /*!< 0x00000FFF */
#define ADC_INJDOF2_INJDOF2                                         ADC_INJDOF2_INJDOF2_Msk                                        /*!<Data offset for injected channel 2 */

/******************  Bit definition for ADC_INJDOF3 register  *******************/
#define ADC_INJDOF3_INJDOF3_Pos                                     (0U)
#define ADC_INJDOF3_INJDOF3_Msk                                     (0xFFFUL << ADC_INJDOF3_INJDOF3_Pos)                           /*!< 0x00000FFF */
#define ADC_INJDOF3_INJDOF3                                         ADC_INJDOF3_INJDOF3_Msk                                        /*!<Data offset for injected channel 3 */

/******************  Bit definition for ADC_INJDOF4 register  *******************/
#define ADC_INJDOF4_INJDOF4_Pos                                     (0U)
#define ADC_INJDOF4_INJDOF4_Msk                                     (0xFFFUL << ADC_INJDOF4_INJDOF4_Pos)                           /*!< 0x00000FFF */
#define ADC_INJDOF4_INJDOF4                                         ADC_INJDOF4_INJDOF4_Msk                                        /*!<Data offset for injected channel 4 */

/*******************  Bit definition for ADC_AWDHT register  ********************/
#define ADC_AWDHT_AWDHT_Pos                                         (0U)
#define ADC_AWDHT_AWDHT_Msk                                         (0xFFFUL << ADC_AWDHT_AWDHT_Pos)                               /*!< 0x00000FFF */
#define ADC_AWDHT_AWDHT                                             ADC_AWDHT_AWDHT_Msk                                            /*!<Analog watchdog high threshold */

/*******************  Bit definition for ADC_AWDLT register  ********************/
#define ADC_AWDLT_AWDLT_Pos                                         (0U)
#define ADC_AWDLT_AWDLT_Msk                                         (0xFFFUL << ADC_AWDLT_AWDLT_Pos)                               /*!< 0x00000FFF */
#define ADC_AWDLT_AWDLT                                             ADC_AWDLT_AWDLT_Msk                                            /*!<Analog watchdog low threshold */

/*******************  Bit definition for ADC_REGSEQ1 register  *******************/
#define ADC_REGSEQ1_REGSEQC13_Pos                                   (0U)
#define ADC_REGSEQ1_REGSEQC13_Msk                                   (0x1FUL << ADC_REGSEQ1_REGSEQC13_Pos)                          /*!< 0x0000001F */
#define ADC_REGSEQ1_REGSEQC13                                       ADC_REGSEQ1_REGSEQC13_Msk                                      /*!<SQ13[4:0] bits (13th conversion in regular sequence) */
#define ADC_REGSEQ1_REGSEQC13_0                                     (0x01UL << ADC_REGSEQ1_REGSEQC13_Pos)                          /*!< 0x00000001 */
#define ADC_REGSEQ1_REGSEQC13_1                                     (0x02UL << ADC_REGSEQ1_REGSEQC13_Pos)                          /*!< 0x00000002 */
#define ADC_REGSEQ1_REGSEQC13_2                                     (0x04UL << ADC_REGSEQ1_REGSEQC13_Pos)                          /*!< 0x00000004 */
#define ADC_REGSEQ1_REGSEQC13_3                                     (0x08UL << ADC_REGSEQ1_REGSEQC13_Pos)                          /*!< 0x00000008 */
#define ADC_REGSEQ1_REGSEQC13_4                                     (0x10UL << ADC_REGSEQ1_REGSEQC13_Pos)                          /*!< 0x00000010 */
#define ADC_REGSEQ1_REGSEQC14_Pos                                   (5U)
#define ADC_REGSEQ1_REGSEQC14_Msk                                   (0x1FUL << ADC_REGSEQ1_REGSEQC14_Pos)                          /*!< 0x000003E0 */
#define ADC_REGSEQ1_REGSEQC14                                       ADC_REGSEQ1_REGSEQC14_Msk                                      /*!<SQ14[4:0] bits (14th conversion in regular sequence) */
#define ADC_REGSEQ1_REGSEQC14_0                                     (0x01UL << ADC_REGSEQ1_REGSEQC14_Pos)                          /*!< 0x00000020 */
#define ADC_REGSEQ1_REGSEQC14_1                                     (0x02UL << ADC_REGSEQ1_REGSEQC14_Pos)                          /*!< 0x00000040 */
#define ADC_REGSEQ1_REGSEQC14_2                                     (0x04UL << ADC_REGSEQ1_REGSEQC14_Pos)                          /*!< 0x00000080 */
#define ADC_REGSEQ1_REGSEQC14_3                                     (0x08UL << ADC_REGSEQ1_REGSEQC14_Pos)                          /*!< 0x00000100 */
#define ADC_REGSEQ1_REGSEQC14_4                                     (0x10UL << ADC_REGSEQ1_REGSEQC14_Pos)                          /*!< 0x00000200 */
#define ADC_REGSEQ1_REGSEQC15_Pos                                   (10U)
#define ADC_REGSEQ1_REGSEQC15_Msk                                   (0x1FUL << ADC_REGSEQ1_REGSEQC15_Pos)                          /*!< 0x00007C00 */
#define ADC_REGSEQ1_REGSEQC15                                       ADC_REGSEQ1_REGSEQC15_Msk                                      /*!<SQ15[4:0] bits (15th conversion in regular sequence) */
#define ADC_REGSEQ1_REGSEQC15_0                                     (0x01UL << ADC_REGSEQ1_REGSEQC15_Pos)                          /*!< 0x00000400 */
#define ADC_REGSEQ1_REGSEQC15_1                                     (0x02UL << ADC_REGSEQ1_REGSEQC15_Pos)                          /*!< 0x00000800 */
#define ADC_REGSEQ1_REGSEQC15_2                                     (0x04UL << ADC_REGSEQ1_REGSEQC15_Pos)                          /*!< 0x00001000 */
#define ADC_REGSEQ1_REGSEQC15_3                                     (0x08UL << ADC_REGSEQ1_REGSEQC15_Pos)                          /*!< 0x00002000 */
#define ADC_REGSEQ1_REGSEQC15_4                                     (0x10UL << ADC_REGSEQ1_REGSEQC15_Pos)                          /*!< 0x00004000 */
#define ADC_REGSEQ1_REGSEQC16_Pos                                   (15U)
#define ADC_REGSEQ1_REGSEQC16_Msk                                   (0x1FUL << ADC_REGSEQ1_REGSEQC16_Pos)                          /*!< 0x000F8000 */
#define ADC_REGSEQ1_REGSEQC16                                       ADC_REGSEQ1_REGSEQC16_Msk                                      /*!<SQ16[4:0] bits (16th conversion in regular sequence) */
#define ADC_REGSEQ1_REGSEQC16_0                                     (0x01UL << ADC_REGSEQ1_REGSEQC16_Pos)                          /*!< 0x00008000 */
#define ADC_REGSEQ1_REGSEQC16_1                                     (0x02UL << ADC_REGSEQ1_REGSEQC16_Pos)                          /*!< 0x00010000 */
#define ADC_REGSEQ1_REGSEQC16_2                                     (0x04UL << ADC_REGSEQ1_REGSEQC16_Pos)                          /*!< 0x00020000 */
#define ADC_REGSEQ1_REGSEQC16_3                                     (0x08UL << ADC_REGSEQ1_REGSEQC16_Pos)                          /*!< 0x00040000 */
#define ADC_REGSEQ1_REGSEQC16_4                                     (0x10UL << ADC_REGSEQ1_REGSEQC16_Pos)                          /*!< 0x00080000 */
#define ADC_REGSEQ1_REGSEQLEN_Pos                                   (20U)
#define ADC_REGSEQ1_REGSEQLEN_Msk                                   (0xFUL << ADC_REGSEQ1_REGSEQLEN_Pos)                           /*!< 0x00F00000 */
#define ADC_REGSEQ1_REGSEQLEN                                       ADC_REGSEQ1_REGSEQLEN_Msk                                      /*!<L[3:0] bits (Regular channel sequence length) */
#define ADC_REGSEQ1_REGSEQLEN_0                                     (0x1UL << ADC_REGSEQ1_REGSEQLEN_Pos)                           /*!< 0x00100000 */
#define ADC_REGSEQ1_REGSEQLEN_1                                     (0x2UL << ADC_REGSEQ1_REGSEQLEN_Pos)                           /*!< 0x00200000 */
#define ADC_REGSEQ1_REGSEQLEN_2                                     (0x4UL << ADC_REGSEQ1_REGSEQLEN_Pos)                           /*!< 0x00400000 */
#define ADC_REGSEQ1_REGSEQLEN_3                                     (0x8UL << ADC_REGSEQ1_REGSEQLEN_Pos)                           /*!< 0x00800000 */

