betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/* Legacy defines */
#define ADC_CSTS_DOVR1                                              ADC_CSTS_OVRFLG1
#define ADC_CSTS_DOVR2                                              ADC_CSTS_OVRFLG2
#define ADC_CSTS_DOVR3                                              ADC_CSTS_OVRFLG3

/*******************  Bit definition for ADC_CCTRL register  ********************/
#define ADC_CCTRL_ADCMSEL_Pos                                       (0U)
#define ADC_CCTRL_ADCMSEL_Msk                                       (0x1FUL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x0000001F */
#define ADC_CCTRL_ADCMSEL                                           ADC_CCTRL_ADCMSEL_Msk                                          /*!<MULTI[4:0] bits (Multi-ADC mode selection) */
#define ADC_CCTRL_ADCMSEL_0                                         (0x01UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000001 */
#define ADC_CCTRL_ADCMSEL_1                                         (0x02UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000002 */
#define ADC_CCTRL_ADCMSEL_2                                         (0x04UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000004 */
#define ADC_CCTRL_ADCMSEL_3                                         (0x08UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000008 */
#define ADC_CCTRL_ADCMSEL_4                                         (0x10UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000010 */
#define ADC_CCTRL_SMPDEL2_Pos                                       (8U)
#define ADC_CCTRL_SMPDEL2_Msk                                       (0xFUL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000F00 */
#define ADC_CCTRL_SMPDEL2                                           ADC_CCTRL_SMPDEL2_Msk                                          /*!<DELAY[3:0] bits (Delay between 2 sampling phases) */
#define ADC_CCTRL_SMPDEL2_0                                         (0x1UL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000100 */
#define ADC_CCTRL_SMPDEL2_1                                         (0x2UL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000200 */
#define ADC_CCTRL_SMPDEL2_2                                         (0x4UL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000400 */
#define ADC_CCTRL_SMPDEL2_3                                         (0x8UL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000800 */
#define ADC_CCTRL_DMAMODEDISSEL_Pos                                 (13U)
#define ADC_CCTRL_DMAMODEDISSEL_Msk                                 (0x1UL << ADC_CCTRL_DMAMODEDISSEL_Pos)                         /*!< 0x00002000 */
#define ADC_CCTRL_DMAMODEDISSEL                                     ADC_CCTRL_DMAMODEDISSEL_Msk                                    /*!<DMA disable selection (Multi-ADC mode) */
#define ADC_CCTRL_DMAMODE_Pos                                       (14U)
#define ADC_CCTRL_DMAMODE_Msk                                       (0x3UL << ADC_CCTRL_DMAMODE_Pos)                               /*!< 0x0000C000 */
#define ADC_CCTRL_DMAMODE                                           ADC_CCTRL_DMAMODE_Msk                                          /*!<DMA[1:0] bits (Direct Memory Access mode for multimode) */
#define ADC_CCTRL_DMAMODE_0                                         (0x1UL << ADC_CCTRL_DMAMODE_Pos)                               /*!< 0x00004000 */
#define ADC_CCTRL_DMAMODE_1                                         (0x2UL << ADC_CCTRL_DMAMODE_Pos)                               /*!< 0x00008000 */
#define ADC_CCTRL_ADCPRE_Pos                                        (16U)
#define ADC_CCTRL_ADCPRE_Msk                                        (0x3UL << ADC_CCTRL_ADCPRE_Pos)                                /*!< 0x00030000 */
#define ADC_CCTRL_ADCPRE                                            ADC_CCTRL_ADCPRE_Msk                                           /*!<ADCPRE[1:0] bits (ADC prescaler) */
#define ADC_CCTRL_ADCPRE_0                                          (0x1UL << ADC_CCTRL_ADCPRE_Pos)                                /*!< 0x00010000 */
#define ADC_CCTRL_ADCPRE_1                                          (0x2UL << ADC_CCTRL_ADCPRE_Pos)                                /*!< 0x00020000 */
#define ADC_CCTRL_VBATEN_Pos                                        (22U)
#define ADC_CCTRL_VBATEN_Msk                                        (0x1UL << ADC_CCTRL_VBATEN_Pos)                                /*!< 0x00400000 */
#define ADC_CCTRL_VBATEN                                            ADC_CCTRL_VBATEN_Msk                                           /*!<VBAT Enable */
#define ADC_CCTRL_TSVREFEN_Pos                                      (23U)
#define ADC_CCTRL_TSVREFEN_Msk                                      (0x1UL << ADC_CCTRL_TSVREFEN_Pos)                              /*!< 0x00800000 */
#define ADC_CCTRL_TSVREFEN                                          ADC_CCTRL_TSVREFEN_Msk                                         /*!<Temperature Sensor and VREFINT Enable */

/*******************  Bit definition for ADC_CDATA register  ********************/
#define ADC_CDATA_DATA1_Pos                                         (0U)
#define ADC_CDATA_DATA1_Msk                                         (0xFFFFUL << ADC_CDATA_DATA1_Pos)                              /*!< 0x0000FFFF */
#define ADC_CDATA_DATA1                                             ADC_CDATA_DATA1_Msk                                            /*!<1st data of a pair of regular conversions */
#define ADC_CDATA_DATA2_Pos                                         (16U)
#define ADC_CDATA_DATA2_Msk                                         (0xFFFFUL << ADC_CDATA_DATA2_Pos)                              /*!< 0xFFFF0000 */
#define ADC_CDATA_DATA2                                             ADC_CDATA_DATA2_Msk                                            /*!<2nd data of a pair of regular conversions */

