betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/*******************  Bit definition for CAN_RXMID1 register  *******************/
#define CAN_RXMID1_RFTXREQ_Pos                                      (1U)
#define CAN_RXMID1_RFTXREQ_Msk                                      (0x1UL << CAN_RXMID1_RFTXREQ_Pos)                              /*!< 0x00000002 */
#define CAN_RXMID1_RFTXREQ                                          CAN_RXMID1_RFTXREQ_Msk                                         /*!<Remote Transmission Request */
#define CAN_RXMID1_IDTYPESEL_Pos                                    (2U)
#define CAN_RXMID1_IDTYPESEL_Msk                                    (0x1UL << CAN_RXMID1_IDTYPESEL_Pos)                            /*!< 0x00000004 */
#define CAN_RXMID1_IDTYPESEL                                        CAN_RXMID1_IDTYPESEL_Msk                                       /*!<Identifier Extension */
#define CAN_RXMID1_EXTID_Pos                                        (3U)
#define CAN_RXMID1_EXTID_Msk                                        (0x3FFFFUL << CAN_RXMID1_EXTID_Pos)                            /*!< 0x001FFFF8 */
#define CAN_RXMID1_EXTID                                            CAN_RXMID1_EXTID_Msk                                           /*!<Extended identifier */
#define CAN_RXMID1_STDID_Pos                                        (21U)
#define CAN_RXMID1_STDID_Msk                                        (0x7FFUL << CAN_RXMID1_STDID_Pos)                              /*!< 0xFFE00000 */
#define CAN_RXMID1_STDID                                            CAN_RXMID1_STDID_Msk                                           /*!<Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_RXDLEN1 register  ******************/
#define CAN_RXDLEN1_DLCODE_Pos                                      (0U)
#define CAN_RXDLEN1_DLCODE_Msk                                      (0xFUL << CAN_RXDLEN1_DLCODE_Pos)                              /*!< 0x0000000F */
#define CAN_RXDLEN1_DLCODE                                          CAN_RXDLEN1_DLCODE_Msk                                         /*!<Data Length Code */
#define CAN_RXDLEN1_FMIDX_Pos                                       (8U)
#define CAN_RXDLEN1_FMIDX_Msk                                       (0xFFUL << CAN_RXDLEN1_FMIDX_Pos)                              /*!< 0x0000FF00 */
#define CAN_RXDLEN1_FMIDX                                           CAN_RXDLEN1_FMIDX_Msk                                          /*!<Filter Match Index */
#define CAN_RXDLEN1_MTS_Pos                                         (16U)
#define CAN_RXDLEN1_MTS_Msk                                         (0xFFFFUL << CAN_RXDLEN1_MTS_Pos)                              /*!< 0xFFFF0000 */
#define CAN_RXDLEN1_MTS                                             CAN_RXDLEN1_MTS_Msk                                            /*!<Message Time Stamp */

/*******************  Bit definition for CAN_RXMDL1 register  ******************/
#define CAN_RXMDL1_DATABYTE0_Pos                                    (0U)
#define CAN_RXMDL1_DATABYTE0_Msk                                    (0xFFUL << CAN_RXMDL1_DATABYTE0_Pos)                           /*!< 0x000000FF */
#define CAN_RXMDL1_DATABYTE0                                        CAN_RXMDL1_DATABYTE0_Msk                                       /*!<Data byte 0 */
#define CAN_RXMDL1_DATABYTE1_Pos                                    (8U)
#define CAN_RXMDL1_DATABYTE1_Msk                                    (0xFFUL << CAN_RXMDL1_DATABYTE1_Pos)                           /*!< 0x0000FF00 */
#define CAN_RXMDL1_DATABYTE1                                        CAN_RXMDL1_DATABYTE1_Msk                                       /*!<Data byte 1 */
#define CAN_RXMDL1_DATABYTE2_Pos                                    (16U)
#define CAN_RXMDL1_DATABYTE2_Msk                                    (0xFFUL << CAN_RXMDL1_DATABYTE2_Pos)                           /*!< 0x00FF0000 */
#define CAN_RXMDL1_DATABYTE2                                        CAN_RXMDL1_DATABYTE2_Msk                                       /*!<Data byte 2 */
#define CAN_RXMDL1_DATABYTE3_Pos                                    (24U)
#define CAN_RXMDL1_DATABYTE3_Msk                                    (0xFFUL << CAN_RXMDL1_DATABYTE3_Pos)                           /*!< 0xFF000000 */
#define CAN_RXMDL1_DATABYTE3                                        CAN_RXMDL1_DATABYTE3_Msk                                       /*!<Data byte 3 */

/*******************  Bit definition for CAN_RXMDH1 register  ******************/
#define CAN_RXMDH1_DATABYTE4_Pos                                    (0U)
#define CAN_RXMDH1_DATABYTE4_Msk                                    (0xFFUL << CAN_RXMDH1_DATABYTE4_Pos)                           /*!< 0x000000FF */
#define CAN_RXMDH1_DATABYTE4                                        CAN_RXMDH1_DATABYTE4_Msk                                       /*!<Data byte 4 */
#define CAN_RXMDH1_DATABYTE5_Pos                                    (8U)
#define CAN_RXMDH1_DATABYTE5_Msk                                    (0xFFUL << CAN_RXMDH1_DATABYTE5_Pos)                           /*!< 0x0000FF00 */
#define CAN_RXMDH1_DATABYTE5                                        CAN_RXMDH1_DATABYTE5_Msk                                       /*!<Data byte 5 */
#define CAN_RXMDH1_DATABYTE6_Pos                                    (16U)
#define CAN_RXMDH1_DATABYTE6_Msk                                    (0xFFUL << CAN_RXMDH1_DATABYTE6_Pos)                           /*!< 0x00FF0000 */
#define CAN_RXMDH1_DATABYTE6                                        CAN_RXMDH1_DATABYTE6_Msk                                       /*!<Data byte 6 */
#define CAN_RXMDH1_DATABYTE7_Pos                                    (24U)
#define CAN_RXMDH1_DATABYTE7_Msk                                    (0xFFUL << CAN_RXMDH1_DATABYTE7_Pos)                           /*!< 0xFF000000 */
#define CAN_RXMDH1_DATABYTE7                                        CAN_RXMDH1_DATABYTE7_Msk                                       /*!<Data byte 7 */

