betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/*******************  Bit definition for CAN_F11BANK1 register  ******************/
#define CAN_F11BANK1_FBIT0_Pos                                      (0U)
#define CAN_F11BANK1_FBIT0_Msk                                      (0x1UL << CAN_F11BANK1_FBIT0_Pos)                              /*!< 0x00000001 */
#define CAN_F11BANK1_FBIT0                                          CAN_F11BANK1_FBIT0_Msk                                         /*!<Filter bit 0 */
#define CAN_F11BANK1_FBIT1_Pos                                      (1U)
#define CAN_F11BANK1_FBIT1_Msk                                      (0x1UL << CAN_F11BANK1_FBIT1_Pos)                              /*!< 0x00000002 */
#define CAN_F11BANK1_FBIT1                                          CAN_F11BANK1_FBIT1_Msk                                         /*!<Filter bit 1 */
#define CAN_F11BANK1_FBIT2_Pos                                      (2U)
#define CAN_F11BANK1_FBIT2_Msk                                      (0x1UL << CAN_F11BANK1_FBIT2_Pos)                              /*!< 0x00000004 */
#define CAN_F11BANK1_FBIT2                                          CAN_F11BANK1_FBIT2_Msk                                         /*!<Filter bit 2 */
#define CAN_F11BANK1_FBIT3_Pos                                      (3U)
#define CAN_F11BANK1_FBIT3_Msk                                      (0x1UL << CAN_F11BANK1_FBIT3_Pos)                              /*!< 0x00000008 */
#define CAN_F11BANK1_FBIT3                                          CAN_F11BANK1_FBIT3_Msk                                         /*!<Filter bit 3 */
#define CAN_F11BANK1_FBIT4_Pos                                      (4U)
#define CAN_F11BANK1_FBIT4_Msk                                      (0x1UL << CAN_F11BANK1_FBIT4_Pos)                              /*!< 0x00000010 */
#define CAN_F11BANK1_FBIT4                                          CAN_F11BANK1_FBIT4_Msk                                         /*!<Filter bit 4 */
#define CAN_F11BANK1_FBIT5_Pos                                      (5U)
#define CAN_F11BANK1_FBIT5_Msk                                      (0x1UL << CAN_F11BANK1_FBIT5_Pos)                              /*!< 0x00000020 */
#define CAN_F11BANK1_FBIT5                                          CAN_F11BANK1_FBIT5_Msk                                         /*!<Filter bit 5 */
#define CAN_F11BANK1_FBIT6_Pos                                      (6U)
#define CAN_F11BANK1_FBIT6_Msk                                      (0x1UL << CAN_F11BANK1_FBIT6_Pos)                              /*!< 0x00000040 */
#define CAN_F11BANK1_FBIT6                                          CAN_F11BANK1_FBIT6_Msk                                         /*!<Filter bit 6 */
#define CAN_F11BANK1_FBIT7_Pos                                      (7U)
#define CAN_F11BANK1_FBIT7_Msk                                      (0x1UL << CAN_F11BANK1_FBIT7_Pos)                              /*!< 0x00000080 */
#define CAN_F11BANK1_FBIT7                                          CAN_F11BANK1_FBIT7_Msk                                         /*!<Filter bit 7 */
#define CAN_F11BANK1_FBIT8_Pos                                      (8U)
#define CAN_F11BANK1_FBIT8_Msk                                      (0x1UL << CAN_F11BANK1_FBIT8_Pos)                              /*!< 0x00000100 */
#define CAN_F11BANK1_FBIT8                                          CAN_F11BANK1_FBIT8_Msk                                         /*!<Filter bit 8 */
#define CAN_F11BANK1_FBIT9_Pos                                      (9U)
#define CAN_F11BANK1_FBIT9_Msk                                      (0x1UL << CAN_F11BANK1_FBIT9_Pos)                              /*!< 0x00000200 */
#define CAN_F11BANK1_FBIT9                                          CAN_F11BANK1_FBIT9_Msk                                         /*!<Filter bit 9 */
#define CAN_F11BANK1_FBIT10_Pos                                     (10U)
#define CAN_F11BANK1_FBIT10_Msk                                     (0x1UL << CAN_F11BANK1_FBIT10_Pos)                             /*!< 0x00000400 */
#define CAN_F11BANK1_FBIT10                                         CAN_F11BANK1_FBIT10_Msk                                        /*!<Filter bit 10 */
#define CAN_F11BANK1_FBIT11_Pos                                     (11U)
#define CAN_F11BANK1_FBIT11_Msk                                     (0x1UL << CAN_F11BANK1_FBIT11_Pos)                             /*!< 0x00000800 */
#define CAN_F11BANK1_FBIT11                                         CAN_F11BANK1_FBIT11_Msk                                        /*!<Filter bit 11 */
#define CAN_F11BANK1_FBIT12_Pos                                     (12U)
#define CAN_F11BANK1_FBIT12_Msk                                     (0x1UL << CAN_F11BANK1_FBIT12_Pos)                             /*!< 0x00001000 */
#define CAN_F11BANK1_FBIT12                                         CAN_F11BANK1_FBIT12_Msk                                        /*!<Filter bit 12 */
#define CAN_F11BANK1_FBIT13_Pos                                     (13U)
#define CAN_F11BANK1_FBIT13_Msk                                     (0x1UL << CAN_F11BANK1_FBIT13_Pos)                             /*!< 0x00002000 */
#define CAN_F11BANK1_FBIT13                                         CAN_F11BANK1_FBIT13_Msk                                        /*!<Filter bit 13 */
#define CAN_F11BANK1_FBIT14_Pos                                     (14U)
#define CAN_F11BANK1_FBIT14_Msk                                     (0x1UL << CAN_F11BANK1_FBIT14_Pos)                             /*!< 0x00004000 */
#define CAN_F11BANK1_FBIT14                                         CAN_F11BANK1_FBIT14_Msk                                        /*!<Filter bit 14 */
#define CAN_F11BANK1_FBIT15_Pos                                     (15U)
#define CAN_F11BANK1_FBIT15_Msk                                     (0x1UL << CAN_F11BANK1_FBIT15_Pos)                             /*!< 0x00008000 */
#define CAN_F11BANK1_FBIT15                                         CAN_F11BANK1_FBIT15_Msk                                        /*!<Filter bit 15 */
#define CAN_F11BANK1_FBIT16_Pos                                     (16U)
#define CAN_F11BANK1_FBIT16_Msk                                     (0x1UL << CAN_F11BANK1_FBIT16_Pos)                             /*!< 0x00010000 */
#define CAN_F11BANK1_FBIT16                                         CAN_F11BANK1_FBIT16_Msk                                        /*!<Filter bit 16 */
#define CAN_F11BANK1_FBIT17_Pos                                     (17U)
#define CAN_F11BANK1_FBIT17_Msk                                     (0x1UL << CAN_F11BANK1_FBIT17_Pos)                             /*!< 0x00020000 */
#define CAN_F11BANK1_FBIT17                                         CAN_F11BANK1_FBIT17_Msk                                        /*!<Filter bit 17 */
#define CAN_F11BANK1_FBIT18_Pos                                     (18U)
#define CAN_F11BANK1_FBIT18_Msk                                     (0x1UL << CAN_F11BANK1_FBIT18_Pos)                             /*!< 0x00040000 */
#define CAN_F11BANK1_FBIT18                                         CAN_F11BANK1_FBIT18_Msk                                        /*!<Filter bit 18 */
#define CAN_F11BANK1_FBIT19_Pos                                     (19U)
#define CAN_F11BANK1_FBIT19_Msk                                     (0x1UL << CAN_F11BANK1_FBIT19_Pos)                             /*!< 0x00080000 */
#define CAN_F11BANK1_FBIT19                                         CAN_F11BANK1_FBIT19_Msk                                        /*!<Filter bit 19 */
#define CAN_F11BANK1_FBIT20_Pos                                     (20U)
#define CAN_F11BANK1_FBIT20_Msk                                     (0x1UL << CAN_F11BANK1_FBIT20_Pos)                             /*!< 0x00100000 */
#define CAN_F11BANK1_FBIT20                                         CAN_F11BANK1_FBIT20_Msk                                        /*!<Filter bit 20 */
#define CAN_F11BANK1_FBIT21_Pos                                     (21U)
#define CAN_F11BANK1_FBIT21_Msk                                     (0x1UL << CAN_F11BANK1_FBIT21_Pos)                             /*!< 0x00200000 */
#define CAN_F11BANK1_FBIT21                                         CAN_F11BANK1_FBIT21_Msk                                        /*!<Filter bit 21 */
#define CAN_F11BANK1_FBIT22_Pos                                     (22U)
#define CAN_F11BANK1_FBIT22_Msk                                     (0x1UL << CAN_F11BANK1_FBIT22_Pos)                             /*!< 0x00400000 */
#define CAN_F11BANK1_FBIT22                                         CAN_F11BANK1_FBIT22_Msk                                        /*!<Filter bit 22 */
#define CAN_F11BANK1_FBIT23_Pos                                     (23U)
#define CAN_F11BANK1_FBIT23_Msk                                     (0x1UL << CAN_F11BANK1_FBIT23_Pos)                             /*!< 0x00800000 */
#define CAN_F11BANK1_FBIT23                                         CAN_F11BANK1_FBIT23_Msk                                        /*!<Filter bit 23 */
#define CAN_F11BANK1_FBIT24_Pos                                     (24U)
#define CAN_F11BANK1_FBIT24_Msk                                     (0x1UL << CAN_F11BANK1_FBIT24_Pos)                             /*!< 0x01000000 */
#define CAN_F11BANK1_FBIT24                                         CAN_F11BANK1_FBIT24_Msk                                        /*!<Filter bit 24 */
#define CAN_F11BANK1_FBIT25_Pos                                     (25U)
#define CAN_F11BANK1_FBIT25_Msk                                     (0x1UL << CAN_F11BANK1_FBIT25_Pos)                             /*!< 0x02000000 */
#define CAN_F11BANK1_FBIT25                                         CAN_F11BANK1_FBIT25_Msk                                        /*!<Filter bit 25 */
#define CAN_F11BANK1_FBIT26_Pos                                     (26U)
#define CAN_F11BANK1_FBIT26_Msk                                     (0x1UL << CAN_F11BANK1_FBIT26_Pos)                             /*!< 0x04000000 */
#define CAN_F11BANK1_FBIT26                                         CAN_F11BANK1_FBIT26_Msk                                        /*!<Filter bit 26 */
#define CAN_F11BANK1_FBIT27_Pos                                     (27U)
#define CAN_F11BANK1_FBIT27_Msk                                     (0x1UL << CAN_F11BANK1_FBIT27_Pos)                             /*!< 0x08000000 */
#define CAN_F11BANK1_FBIT27                                         CAN_F11BANK1_FBIT27_Msk                                        /*!<Filter bit 27 */
#define CAN_F11BANK1_FBIT28_Pos                                     (28U)
#define CAN_F11BANK1_FBIT28_Msk                                     (0x1UL << CAN_F11BANK1_FBIT28_Pos)                             /*!< 0x10000000 */
#define CAN_F11BANK1_FBIT28                                         CAN_F11BANK1_FBIT28_Msk                                        /*!<Filter bit 28 */
#define CAN_F11BANK1_FBIT29_Pos                                     (29U)
#define CAN_F11BANK1_FBIT29_Msk                                     (0x1UL << CAN_F11BANK1_FBIT29_Pos)                             /*!< 0x20000000 */
#define CAN_F11BANK1_FBIT29                                         CAN_F11BANK1_FBIT29_Msk                                        /*!<Filter bit 29 */
#define CAN_F11BANK1_FBIT30_Pos                                     (30U)
#define CAN_F11BANK1_FBIT30_Msk                                     (0x1UL << CAN_F11BANK1_FBIT30_Pos)                             /*!< 0x40000000 */
#define CAN_F11BANK1_FBIT30                                         CAN_F11BANK1_FBIT30_Msk                                        /*!<Filter bit 30 */
#define CAN_F11BANK1_FBIT31_Pos                                     (31U)
#define CAN_F11BANK1_FBIT31_Msk                                     (0x1UL << CAN_F11BANK1_FBIT31_Pos)                             /*!< 0x80000000 */
#define CAN_F11BANK1_FBIT31                                         CAN_F11BANK1_FBIT31_Msk                                        /*!<Filter bit 31 */

