betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/******************  Bit definition for DAC_DH8R2 register  ******************/
#define DAC_DH8R2_DATA_Pos                                          (0U)
#define DAC_DH8R2_DATA_Msk                                          (0xFFUL << DAC_DH8R2_DATA_Pos)                                 /*!< 0x000000FF */
#define DAC_DH8R2_DATA                                              DAC_DH8R2_DATA_Msk                                             /*!<DAC channel2 8-bit Right aligned data */

/*****************  Bit definition for DAC_DH12RDUAL register  ******************/
#define DAC_DH12RDUAL_DATACH1_Pos                                   (0U)
#define DAC_DH12RDUAL_DATACH1_Msk                                   (0xFFFUL << DAC_DH12RDUAL_DATACH1_Pos)                         /*!< 0x00000FFF */
#define DAC_DH12RDUAL_DATACH1                                       DAC_DH12RDUAL_DATACH1_Msk                                      /*!<DAC channel1 12-bit Right aligned data */
#define DAC_DH12RDUAL_DATACH2_Pos                                   (16U)
#define DAC_DH12RDUAL_DATACH2_Msk                                   (0xFFFUL << DAC_DH12RDUAL_DATACH2_Pos)                         /*!< 0x0FFF0000 */
#define DAC_DH12RDUAL_DATACH2                                       DAC_DH12RDUAL_DATACH2_Msk                                      /*!<DAC channel2 12-bit Right aligned data */

/*****************  Bit definition for DAC_DH12LDUAL register  ******************/
#define DAC_DH12LDUAL_DATACH1_Pos                                   (4U)
#define DAC_DH12LDUAL_DATACH1_Msk                                   (0xFFFUL << DAC_DH12LDUAL_DATACH1_Pos)                         /*!< 0x0000FFF0 */
#define DAC_DH12LDUAL_DATACH1                                       DAC_DH12LDUAL_DATACH1_Msk                                      /*!<DAC channel1 12-bit Left aligned data */
#define DAC_DH12LDUAL_DATACH2_Pos                                   (20U)
#define DAC_DH12LDUAL_DATACH2_Msk                                   (0xFFFUL << DAC_DH12LDUAL_DATACH2_Pos)                         /*!< 0xFFF00000 */
#define DAC_DH12LDUAL_DATACH2                                       DAC_DH12LDUAL_DATACH2_Msk                                      /*!<DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_DH8RDUAL register  ******************/
#define DAC_DH8RDUAL_DATACH1_Pos                                    (0U)
#define DAC_DH8RDUAL_DATACH1_Msk                                    (0xFFUL << DAC_DH8RDUAL_DATACH1_Pos)                           /*!< 0x000000FF */
#define DAC_DH8RDUAL_DATACH1                                        DAC_DH8RDUAL_DATACH1_Msk                                       /*!<DAC channel1 8-bit Right aligned data */
#define DAC_DH8RDUAL_DATACH2_Pos                                    (8U)
#define DAC_DH8RDUAL_DATACH2_Msk                                    (0xFFUL << DAC_DH8RDUAL_DATACH2_Pos)                           /*!< 0x0000FF00 */
#define DAC_DH8RDUAL_DATACH2                                        DAC_DH8RDUAL_DATACH2_Msk                                       /*!<DAC channel2 8-bit Right aligned data */

/*******************  Bit definition for DAC_DATAOCH1 register  *******************/
#define DAC_DATAOCH1_DATA_Pos                                       (0U)
#define DAC_DATAOCH1_DATA_Msk                                       (0xFFFUL << DAC_DATAOCH1_DATA_Pos)                             /*!< 0x00000FFF */
#define DAC_DATAOCH1_DATA                                           DAC_DATAOCH1_DATA_Msk                                          /*!<DAC channel1 data output */

/*******************  Bit definition for DAC_DATAOCH2 register  *******************/
#define DAC_DATAOCH2_DATA_Pos                                       (0U)
#define DAC_DATAOCH2_DATA_Msk                                       (0xFFFUL << DAC_DATAOCH2_DATA_Pos)                             /*!< 0x00000FFF */
#define DAC_DATAOCH2_DATA                                           DAC_DATAOCH2_DATA_Msk                                          /*!<DAC channel2 data output */

/********************  Bit definition for DAC_STS register  ********************/
#define DAC_STS_DMAUDFLG1_Pos                                       (13U)
#define DAC_STS_DMAUDFLG1_Msk                                       (0x1UL << DAC_STS_DMAUDFLG1_Pos)                               /*!< 0x00002000 */
#define DAC_STS_DMAUDFLG1                                           DAC_STS_DMAUDFLG1_Msk                                          /*!<DAC channel1 DMA underrun flag */
#define DAC_STS_DMAUDFLG2_Pos                                       (29U)
#define DAC_STS_DMAUDFLG2_Msk                                       (0x1UL << DAC_STS_DMAUDFLG2_Pos)                               /*!< 0x20000000 */
#define DAC_STS_DMAUDFLG2                                           DAC_STS_DMAUDFLG2_Msk                                          /*!<DAC channel2 DMA underrun flag */

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_SCFGx register  *****************/
#define DMA_SCFGx_CHSEL_Pos                                         (25U)
#define DMA_SCFGx_CHSEL_Msk                                         (0x7UL << DMA_SCFGx_CHSEL_Pos)                                 /*!< 0x0E000000 */
#define DMA_SCFGx_CHSEL                                             DMA_SCFGx_CHSEL_Msk
#define DMA_SCFGx_CHSEL_0                                           0x02000000U
#define DMA_SCFGx_CHSEL_1                                           0x04000000U
#define DMA_SCFGx_CHSEL_2                                           0x08000000U
#define DMA_SCFGx_MBCFG_Pos                                         (23U)
#define DMA_SCFGx_MBCFG_Msk                                         (0x3UL << DMA_SCFGx_MBCFG_Pos)                                 /*!< 0x01800000 */
#define DMA_SCFGx_MBCFG                                             DMA_SCFGx_MBCFG_Msk
#define DMA_SCFGx_MBCFG_0                                           (0x1UL << DMA_SCFGx_MBCFG_Pos)                                 /*!< 0x00800000 */
#define DMA_SCFGx_MBCFG_1                                           (0x2UL << DMA_SCFGx_MBCFG_Pos)                                 /*!< 0x01000000 */
#define DMA_SCFGx_PBCFG_Pos                                         (21U)
#define DMA_SCFGx_PBCFG_Msk                                         (0x3UL << DMA_SCFGx_PBCFG_Pos)                                 /*!< 0x00600000 */
#define DMA_SCFGx_PBCFG                                             DMA_SCFGx_PBCFG_Msk
#define DMA_SCFGx_PBCFG_0                                           (0x1UL << DMA_SCFGx_PBCFG_Pos)                                 /*!< 0x00200000 */
#define DMA_SCFGx_PBCFG_1                                           (0x2UL << DMA_SCFGx_PBCFG_Pos)                                 /*!< 0x00400000 */
#define DMA_SCFGx_CTARG_Pos                                         (19U)
#define DMA_SCFGx_CTARG_Msk                                         (0x1UL << DMA_SCFGx_CTARG_Pos)                                 /*!< 0x00080000 */
#define DMA_SCFGx_CTARG                                             DMA_SCFGx_CTARG_Msk
#define DMA_SCFGx_DBM_Pos                                           (18U)
#define DMA_SCFGx_DBM_Msk                                           (0x1UL << DMA_SCFGx_DBM_Pos)                                   /*!< 0x00040000 */
#define DMA_SCFGx_DBM                                               DMA_SCFGx_DBM_Msk
#define DMA_SCFGx_PRILCFG_Pos                                       (16U)
#define DMA_SCFGx_PRILCFG_Msk                                       (0x3UL << DMA_SCFGx_PRILCFG_Pos)                               /*!< 0x00030000 */
#define DMA_SCFGx_PRILCFG                                           DMA_SCFGx_PRILCFG_Msk
#define DMA_SCFGx_PRILCFG_0                                         (0x1UL << DMA_SCFGx_PRILCFG_Pos)                               /*!< 0x00010000 */
#define DMA_SCFGx_PRILCFG_1                                         (0x2UL << DMA_SCFGx_PRILCFG_Pos)                               /*!< 0x00020000 */
#define DMA_SCFGx_PERIOSIZE_Pos                                     (15U)
#define DMA_SCFGx_PERIOSIZE_Msk                                     (0x1UL << DMA_SCFGx_PERIOSIZE_Pos)                             /*!< 0x00008000 */
#define DMA_SCFGx_PERIOSIZE                                         DMA_SCFGx_PERIOSIZE_Msk
#define DMA_SCFGx_MEMSIZECFG_Pos                                    (13U)
#define DMA_SCFGx_MEMSIZECFG_Msk                                    (0x3UL << DMA_SCFGx_MEMSIZECFG_Pos)                            /*!< 0x00006000 */
#define DMA_SCFGx_MEMSIZECFG                                        DMA_SCFGx_MEMSIZECFG_Msk
#define DMA_SCFGx_MEMSIZECFG_0                                      (0x1UL << DMA_SCFGx_MEMSIZECFG_Pos)                            /*!< 0x00002000 */
#define DMA_SCFGx_MEMSIZECFG_1                                      (0x2UL << DMA_SCFGx_MEMSIZECFG_Pos)                            /*!< 0x00004000 */
#define DMA_SCFGx_PERSIZECFG_Pos                                    (11U)
#define DMA_SCFGx_PERSIZECFG_Msk                                    (0x3UL << DMA_SCFGx_PERSIZECFG_Pos)                            /*!< 0x00001800 */
#define DMA_SCFGx_PERSIZECFG                                        DMA_SCFGx_PERSIZECFG_Msk
#define DMA_SCFGx_PERSIZECFG_0                                      (0x1UL << DMA_SCFGx_PERSIZECFG_Pos)                            /*!< 0x00000800 */
#define DMA_SCFGx_PERSIZECFG_1                                      (0x2UL << DMA_SCFGx_PERSIZECFG_Pos)                            /*!< 0x00001000 */
#define DMA_SCFGx_MEMIM_Pos                                         (10U)
#define DMA_SCFGx_MEMIM_Msk                                         (0x1UL << DMA_SCFGx_MEMIM_Pos)                                 /*!< 0x00000400 */
#define DMA_SCFGx_MEMIM                                             DMA_SCFGx_MEMIM_Msk
#define DMA_SCFGx_PERIM_Pos                                         (9U)
#define DMA_SCFGx_PERIM_Msk                                         (0x1UL << DMA_SCFGx_PERIM_Pos)                                 /*!< 0x00000200 */
#define DMA_SCFGx_PERIM                                             DMA_SCFGx_PERIM_Msk
#define DMA_SCFGx_CIRCMEN_Pos                                       (8U)
#define DMA_SCFGx_CIRCMEN_Msk                                       (0x1UL << DMA_SCFGx_CIRCMEN_Pos)                               /*!< 0x00000100 */
#define DMA_SCFGx_CIRCMEN                                           DMA_SCFGx_CIRCMEN_Msk
#define DMA_SCFGx_DIRCFG_Pos                                        (6U)
#define DMA_SCFGx_DIRCFG_Msk                                        (0x3UL << DMA_SCFGx_DIRCFG_Pos)                                /*!< 0x000000C0 */
#define DMA_SCFGx_DIRCFG                                            DMA_SCFGx_DIRCFG_Msk
#define DMA_SCFGx_DIRCFG_0                                          (0x1UL << DMA_SCFGx_DIRCFG_Pos)                                /*!< 0x00000040 */
#define DMA_SCFGx_DIRCFG_1                                          (0x2UL << DMA_SCFGx_DIRCFG_Pos)                                /*!< 0x00000080 */
#define DMA_SCFGx_PERFC_Pos                                         (5U)
#define DMA_SCFGx_PERFC_Msk                                         (0x1UL << DMA_SCFGx_PERFC_Pos)                                 /*!< 0x00000020 */
#define DMA_SCFGx_PERFC                                             DMA_SCFGx_PERFC_Msk
#define DMA_SCFGx_TXCIEN_Pos                                        (4U)
#define DMA_SCFGx_TXCIEN_Msk                                        (0x1UL << DMA_SCFGx_TXCIEN_Pos)                                /*!< 0x00000010 */
#define DMA_SCFGx_TXCIEN                                            DMA_SCFGx_TXCIEN_Msk
#define DMA_SCFGx_HTXIEN_Pos                                        (3U)
#define DMA_SCFGx_HTXIEN_Msk                                        (0x1UL << DMA_SCFGx_HTXIEN_Pos)                                /*!< 0x00000008 */
#define DMA_SCFGx_HTXIEN                                            DMA_SCFGx_HTXIEN_Msk
#define DMA_SCFGx_TXEIEN_Pos                                        (2U)
#define DMA_SCFGx_TXEIEN_Msk                                        (0x1UL << DMA_SCFGx_TXEIEN_Pos)                                /*!< 0x00000004 */
#define DMA_SCFGx_TXEIEN                                            DMA_SCFGx_TXEIEN_Msk
#define DMA_SCFGx_DMEIEN_Pos                                        (1U)
#define DMA_SCFGx_DMEIEN_Msk                                        (0x1UL << DMA_SCFGx_DMEIEN_Pos)                                /*!< 0x00000002 */
#define DMA_SCFGx_DMEIEN                                            DMA_SCFGx_DMEIEN_Msk
#define DMA_SCFGx_EN_Pos                                            (0U)
#define DMA_SCFGx_EN_Msk                                            (0x1UL << DMA_SCFGx_EN_Pos)                                    /*!< 0x00000001 */
#define DMA_SCFGx_EN                                                DMA_SCFGx_EN_Msk

