betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/********************  Bits definition for DMA_LIFCLR register  ****************/
#define DMA_LIFCLR_CTXCIFLG3_Pos                                    (27U)
#define DMA_LIFCLR_CTXCIFLG3_Msk                                    (0x1UL << DMA_LIFCLR_CTXCIFLG3_Pos)                            /*!< 0x08000000 */
#define DMA_LIFCLR_CTXCIFLG3                                        DMA_LIFCLR_CTXCIFLG3_Msk
#define DMA_LIFCLR_CHTXIFLG3_Pos                                    (26U)
#define DMA_LIFCLR_CHTXIFLG3_Msk                                    (0x1UL << DMA_LIFCLR_CHTXIFLG3_Pos)                            /*!< 0x04000000 */
#define DMA_LIFCLR_CHTXIFLG3                                        DMA_LIFCLR_CHTXIFLG3_Msk
#define DMA_LIFCLR_CTXEIFLG3_Pos                                    (25U)
#define DMA_LIFCLR_CTXEIFLG3_Msk                                    (0x1UL << DMA_LIFCLR_CTXEIFLG3_Pos)                            /*!< 0x02000000 */
#define DMA_LIFCLR_CTXEIFLG3                                        DMA_LIFCLR_CTXEIFLG3_Msk
#define DMA_LIFCLR_CDMEIFLG3_Pos                                    (24U)
#define DMA_LIFCLR_CDMEIFLG3_Msk                                    (0x1UL << DMA_LIFCLR_CDMEIFLG3_Pos)                            /*!< 0x01000000 */
#define DMA_LIFCLR_CDMEIFLG3                                        DMA_LIFCLR_CDMEIFLG3_Msk
#define DMA_LIFCLR_CFEIFLG3_Pos                                     (22U)
#define DMA_LIFCLR_CFEIFLG3_Msk                                     (0x1UL << DMA_LIFCLR_CFEIFLG3_Pos)                             /*!< 0x00400000 */
#define DMA_LIFCLR_CFEIFLG3                                         DMA_LIFCLR_CFEIFLG3_Msk
#define DMA_LIFCLR_CTXCIFLG2_Pos                                    (21U)
#define DMA_LIFCLR_CTXCIFLG2_Msk                                    (0x1UL << DMA_LIFCLR_CTXCIFLG2_Pos)                            /*!< 0x00200000 */
#define DMA_LIFCLR_CTXCIFLG2                                        DMA_LIFCLR_CTXCIFLG2_Msk
#define DMA_LIFCLR_CHTXIFLG2_Pos                                    (20U)
#define DMA_LIFCLR_CHTXIFLG2_Msk                                    (0x1UL << DMA_LIFCLR_CHTXIFLG2_Pos)                            /*!< 0x00100000 */
#define DMA_LIFCLR_CHTXIFLG2                                        DMA_LIFCLR_CHTXIFLG2_Msk
#define DMA_LIFCLR_CTXEIFLG2_Pos                                    (19U)
#define DMA_LIFCLR_CTXEIFLG2_Msk                                    (0x1UL << DMA_LIFCLR_CTXEIFLG2_Pos)                            /*!< 0x00080000 */
#define DMA_LIFCLR_CTXEIFLG2                                        DMA_LIFCLR_CTXEIFLG2_Msk
#define DMA_LIFCLR_CDMEIFLG2_Pos                                    (18U)
#define DMA_LIFCLR_CDMEIFLG2_Msk                                    (0x1UL << DMA_LIFCLR_CDMEIFLG2_Pos)                            /*!< 0x00040000 */
#define DMA_LIFCLR_CDMEIFLG2                                        DMA_LIFCLR_CDMEIFLG2_Msk
#define DMA_LIFCLR_CFEIFLG2_Pos                                     (16U)
#define DMA_LIFCLR_CFEIFLG2_Msk                                     (0x1UL << DMA_LIFCLR_CFEIFLG2_Pos)                             /*!< 0x00010000 */
#define DMA_LIFCLR_CFEIFLG2                                         DMA_LIFCLR_CFEIFLG2_Msk
#define DMA_LIFCLR_CTXCIFLG1_Pos                                    (11U)
#define DMA_LIFCLR_CTXCIFLG1_Msk                                    (0x1UL << DMA_LIFCLR_CTXCIFLG1_Pos)                            /*!< 0x00000800 */
#define DMA_LIFCLR_CTXCIFLG1                                        DMA_LIFCLR_CTXCIFLG1_Msk
#define DMA_LIFCLR_CHTXIFLG1_Pos                                    (10U)
#define DMA_LIFCLR_CHTXIFLG1_Msk                                    (0x1UL << DMA_LIFCLR_CHTXIFLG1_Pos)                            /*!< 0x00000400 */
#define DMA_LIFCLR_CHTXIFLG1                                        DMA_LIFCLR_CHTXIFLG1_Msk
#define DMA_LIFCLR_CTXEIFLG1_Pos                                    (9U)
#define DMA_LIFCLR_CTXEIFLG1_Msk                                    (0x1UL << DMA_LIFCLR_CTXEIFLG1_Pos)                            /*!< 0x00000200 */
#define DMA_LIFCLR_CTXEIFLG1                                        DMA_LIFCLR_CTXEIFLG1_Msk
#define DMA_LIFCLR_CDMEIFLG1_Pos                                    (8U)
#define DMA_LIFCLR_CDMEIFLG1_Msk                                    (0x1UL << DMA_LIFCLR_CDMEIFLG1_Pos)                            /*!< 0x00000100 */
#define DMA_LIFCLR_CDMEIFLG1                                        DMA_LIFCLR_CDMEIFLG1_Msk
#define DMA_LIFCLR_CFEIFLG1_Pos                                     (6U)
#define DMA_LIFCLR_CFEIFLG1_Msk                                     (0x1UL << DMA_LIFCLR_CFEIFLG1_Pos)                             /*!< 0x00000040 */
#define DMA_LIFCLR_CFEIFLG1                                         DMA_LIFCLR_CFEIFLG1_Msk
#define DMA_LIFCLR_CTXCIFLG0_Pos                                    (5U)
#define DMA_LIFCLR_CTXCIFLG0_Msk                                    (0x1UL << DMA_LIFCLR_CTXCIFLG0_Pos)                            /*!< 0x00000020 */
#define DMA_LIFCLR_CTXCIFLG0                                        DMA_LIFCLR_CTXCIFLG0_Msk
#define DMA_LIFCLR_CHTXIFLG0_Pos                                    (4U)
#define DMA_LIFCLR_CHTXIFLG0_Msk                                    (0x1UL << DMA_LIFCLR_CHTXIFLG0_Pos)                            /*!< 0x00000010 */
#define DMA_LIFCLR_CHTXIFLG0                                        DMA_LIFCLR_CHTXIFLG0_Msk
#define DMA_LIFCLR_CTXEIFLG0_Pos                                    (3U)
#define DMA_LIFCLR_CTXEIFLG0_Msk                                    (0x1UL << DMA_LIFCLR_CTXEIFLG0_Pos)                            /*!< 0x00000008 */
#define DMA_LIFCLR_CTXEIFLG0                                        DMA_LIFCLR_CTXEIFLG0_Msk
#define DMA_LIFCLR_CDMEIFLG0_Pos                                    (2U)
#define DMA_LIFCLR_CDMEIFLG0_Msk                                    (0x1UL << DMA_LIFCLR_CDMEIFLG0_Pos)                            /*!< 0x00000004 */
#define DMA_LIFCLR_CDMEIFLG0                                        DMA_LIFCLR_CDMEIFLG0_Msk
#define DMA_LIFCLR_CFEIFLG0_Pos                                     (0U)
#define DMA_LIFCLR_CFEIFLG0_Msk                                     (0x1UL << DMA_LIFCLR_CFEIFLG0_Pos)                             /*!< 0x00000001 */
#define DMA_LIFCLR_CFEIFLG0                                         DMA_LIFCLR_CFEIFLG0_Msk

