betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
#define SMC_CSCTRL1_MTYPECFG_Pos                                    (2U)
#define SMC_CSCTRL1_MTYPECFG_Msk                                    (0x3UL << SMC_CSCTRL1_MTYPECFG_Pos)                            /*!< 0x0000000C */
#define SMC_CSCTRL1_MTYPECFG                                        SMC_CSCTRL1_MTYPECFG_Msk                                       /*!<MTYP[1:0] bits (Memory type)           */
#define SMC_CSCTRL1_MTYPECFG_0                                      (0x1UL << SMC_CSCTRL1_MTYPECFG_Pos)                            /*!< 0x00000004 */
#define SMC_CSCTRL1_MTYPECFG_1                                      (0x2UL << SMC_CSCTRL1_MTYPECFG_Pos)                            /*!< 0x00000008 */

#define SMC_CSCTRL1_MDBWIDCFG_Pos                                   (4U)
#define SMC_CSCTRL1_MDBWIDCFG_Msk                                   (0x3UL << SMC_CSCTRL1_MDBWIDCFG_Pos)                           /*!< 0x00000030 */
#define SMC_CSCTRL1_MDBWIDCFG                                       SMC_CSCTRL1_MDBWIDCFG_Msk                                      /*!<MWID[1:0] bits (Memory data bus width) */
#define SMC_CSCTRL1_MDBWIDCFG_0                                     (0x1UL << SMC_CSCTRL1_MDBWIDCFG_Pos)                           /*!< 0x00000010 */
#define SMC_CSCTRL1_MDBWIDCFG_1                                     (0x2UL << SMC_CSCTRL1_MDBWIDCFG_Pos)                           /*!< 0x00000020 */

#define SMC_CSCTRL1_NORFMACCEN_Pos                                  (6U)
#define SMC_CSCTRL1_NORFMACCEN_Msk                                  (0x1UL << SMC_CSCTRL1_NORFMACCEN_Pos)                          /*!< 0x00000040 */
#define SMC_CSCTRL1_NORFMACCEN                                      SMC_CSCTRL1_NORFMACCEN_Msk                                     /*!<Flash access enable                    */
#define SMC_CSCTRL1_BURSTEN_Pos                                     (8U)
#define SMC_CSCTRL1_BURSTEN_Msk                                     (0x1UL << SMC_CSCTRL1_BURSTEN_Pos)                             /*!< 0x00000100 */
#define SMC_CSCTRL1_BURSTEN                                         SMC_CSCTRL1_BURSTEN_Msk                                        /*!<Burst enable bit                       */
#define SMC_CSCTRL1_WSPOLCFG_Pos                                    (9U)
#define SMC_CSCTRL1_WSPOLCFG_Msk                                    (0x1UL << SMC_CSCTRL1_WSPOLCFG_Pos)                            /*!< 0x00000200 */
#define SMC_CSCTRL1_WSPOLCFG                                        SMC_CSCTRL1_WSPOLCFG_Msk                                       /*!<Wait signal polarity bit               */
#define SMC_CSCTRL1_WRAPBEN_Pos                                     (10U)
#define SMC_CSCTRL1_WRAPBEN_Msk                                     (0x1UL << SMC_CSCTRL1_WRAPBEN_Pos)                             /*!< 0x00000400 */
#define SMC_CSCTRL1_WRAPBEN                                         SMC_CSCTRL1_WRAPBEN_Msk                                        /*!<Wrapped burst mode support             */
#define SMC_CSCTRL1_WTIMCFG_Pos                                     (11U)
#define SMC_CSCTRL1_WTIMCFG_Msk                                     (0x1UL << SMC_CSCTRL1_WTIMCFG_Pos)                             /*!< 0x00000800 */
#define SMC_CSCTRL1_WTIMCFG                                         SMC_CSCTRL1_WTIMCFG_Msk                                        /*!<Wait timing configuration              */
#define SMC_CSCTRL1_WREN_Pos                                        (12U)
#define SMC_CSCTRL1_WREN_Msk                                        (0x1UL << SMC_CSCTRL1_WREN_Pos)                                /*!< 0x00001000 */
#define SMC_CSCTRL1_WREN                                            SMC_CSCTRL1_WREN_Msk                                           /*!<Write enable bit                       */
#define SMC_CSCTRL1_WAITEN_Pos                                      (13U)
#define SMC_CSCTRL1_WAITEN_Msk                                      (0x1UL << SMC_CSCTRL1_WAITEN_Pos)                              /*!< 0x00002000 */
#define SMC_CSCTRL1_WAITEN                                          SMC_CSCTRL1_WAITEN_Msk                                         /*!<Wait enable bit                        */
#define SMC_CSCTRL1_EXTMODEEN_Pos                                   (14U)
#define SMC_CSCTRL1_EXTMODEEN_Msk                                   (0x1UL << SMC_CSCTRL1_EXTMODEEN_Pos)                           /*!< 0x00004000 */
#define SMC_CSCTRL1_EXTMODEEN                                       SMC_CSCTRL1_EXTMODEEN_Msk                                      /*!<Extended mode enable                   */
#define SMC_CSCTRL1_WSASYNCEN_Pos                                   (15U)
#define SMC_CSCTRL1_WSASYNCEN_Msk                                   (0x1UL << SMC_CSCTRL1_WSASYNCEN_Pos)                           /*!< 0x00008000 */
#define SMC_CSCTRL1_WSASYNCEN                                       SMC_CSCTRL1_WSASYNCEN_Msk                                      /*!<Asynchronous wait                      */
#define SMC_CSCTRL1_CRAMPSIZECFG_Pos                                (16U)
#define SMC_CSCTRL1_CRAMPSIZECFG_Msk                                (0x7UL << SMC_CSCTRL1_CRAMPSIZECFG_Pos)                        /*!< 0x00070000 */
#define SMC_CSCTRL1_CRAMPSIZECFG                                    SMC_CSCTRL1_CRAMPSIZECFG_Msk                                   /*!<CRAM page size */
#define SMC_CSCTRL1_CRAMPSIZECFG_0                                  (0x1UL << SMC_CSCTRL1_CRAMPSIZECFG_Pos)                        /*!< 0x00010000 */
#define SMC_CSCTRL1_CRAMPSIZECFG_1                                  (0x2UL << SMC_CSCTRL1_CRAMPSIZECFG_Pos)                        /*!< 0x00020000 */
#define SMC_CSCTRL1_CRAMPSIZECFG_2                                  (0x4UL << SMC_CSCTRL1_CRAMPSIZECFG_Pos)                        /*!< 0x00040000 */
#define SMC_CSCTRL1_WRBURSTEN_Pos                                   (19U)
#define SMC_CSCTRL1_WRBURSTEN_Msk                                   (0x1UL << SMC_CSCTRL1_WRBURSTEN_Pos)                           /*!< 0x00080000 */
#define SMC_CSCTRL1_WRBURSTEN                                       SMC_CSCTRL1_WRBURSTEN_Msk                                      /*!<Write burst enable                     */

/******************  Bit definition for SMC_CSCTRL2 register  *******************/
#define SMC_CSCTRL2_MBKEN_Pos                                       (0U)
#define SMC_CSCTRL2_MBKEN_Msk                                       (0x1UL << SMC_CSCTRL2_MBKEN_Pos)                               /*!< 0x00000001 */
#define SMC_CSCTRL2_MBKEN                                           SMC_CSCTRL2_MBKEN_Msk                                          /*!<Memory bank enable bit                */
#define SMC_CSCTRL2_ADMUXEN_Pos                                     (1U)
#define SMC_CSCTRL2_ADMUXEN_Msk                                     (0x1UL << SMC_CSCTRL2_ADMUXEN_Pos)                             /*!< 0x00000002 */
#define SMC_CSCTRL2_ADMUXEN                                         SMC_CSCTRL2_ADMUXEN_Msk                                        /*!<Address/data multiplexing enable bit   */

#define SMC_CSCTRL2_MTYPECFG_Pos                                    (2U)
#define SMC_CSCTRL2_MTYPECFG_Msk                                    (0x3UL << SMC_CSCTRL2_MTYPECFG_Pos)                            /*!< 0x0000000C */
#define SMC_CSCTRL2_MTYPECFG                                        SMC_CSCTRL2_MTYPECFG_Msk                                       /*!<MTYP[1:0] bits (Memory type)           */
#define SMC_CSCTRL2_MTYPECFG_0                                      (0x1UL << SMC_CSCTRL2_MTYPECFG_Pos)                            /*!< 0x00000004 */
#define SMC_CSCTRL2_MTYPECFG_1                                      (0x2UL << SMC_CSCTRL2_MTYPECFG_Pos)                            /*!< 0x00000008 */

#define SMC_CSCTRL2_MDBWIDCFG_Pos                                   (4U)
#define SMC_CSCTRL2_MDBWIDCFG_Msk                                   (0x3UL << SMC_CSCTRL2_MDBWIDCFG_Pos)                           /*!< 0x00000030 */
#define SMC_CSCTRL2_MDBWIDCFG                                       SMC_CSCTRL2_MDBWIDCFG_Msk                                      /*!<MWID[1:0] bits (Memory data bus width) */
#define SMC_CSCTRL2_MDBWIDCFG_0                                     (0x1UL << SMC_CSCTRL2_MDBWIDCFG_Pos)                           /*!< 0x00000010 */
#define SMC_CSCTRL2_MDBWIDCFG_1                                     (0x2UL << SMC_CSCTRL2_MDBWIDCFG_Pos)                           /*!< 0x00000020 */

#define SMC_CSCTRL2_NORFMACCEN_Pos                                  (6U)
#define SMC_CSCTRL2_NORFMACCEN_Msk                                  (0x1UL << SMC_CSCTRL2_NORFMACCEN_Pos)                          /*!< 0x00000040 */
#define SMC_CSCTRL2_NORFMACCEN                                      SMC_CSCTRL2_NORFMACCEN_Msk                                     /*!<Flash access enable                    */
#define SMC_CSCTRL2_BURSTEN_Pos                                     (8U)
#define SMC_CSCTRL2_BURSTEN_Msk                                     (0x1UL << SMC_CSCTRL2_BURSTEN_Pos)                             /*!< 0x00000100 */
#define SMC_CSCTRL2_BURSTEN                                         SMC_CSCTRL2_BURSTEN_Msk                                        /*!<Burst enable bit                       */
#define SMC_CSCTRL2_WSPOLCFG_Pos                                    (9U)
#define SMC_CSCTRL2_WSPOLCFG_Msk                                    (0x1UL << SMC_CSCTRL2_WSPOLCFG_Pos)                            /*!< 0x00000200 */
#define SMC_CSCTRL2_WSPOLCFG                                        SMC_CSCTRL2_WSPOLCFG_Msk                                       /*!<Wait signal polarity bit               */
#define SMC_CSCTRL2_WRAPBEN_Pos                                     (10U)
#define SMC_CSCTRL2_WRAPBEN_Msk                                     (0x1UL << SMC_CSCTRL2_WRAPBEN_Pos)                             /*!< 0x00000400 */
#define SMC_CSCTRL2_WRAPBEN                                         SMC_CSCTRL2_WRAPBEN_Msk                                        /*!<Wrapped burst mode support             */
#define SMC_CSCTRL2_WTIMCFG_Pos                                     (11U)
#define SMC_CSCTRL2_WTIMCFG_Msk                                     (0x1UL << SMC_CSCTRL2_WTIMCFG_Pos)                             /*!< 0x00000800 */
#define SMC_CSCTRL2_WTIMCFG                                         SMC_CSCTRL2_WTIMCFG_Msk                                        /*!<Wait timing configuration              */
#define SMC_CSCTRL2_WREN_Pos                                        (12U)
#define SMC_CSCTRL2_WREN_Msk                                        (0x1UL << SMC_CSCTRL2_WREN_Pos)                                /*!< 0x00001000 */
#define SMC_CSCTRL2_WREN                                            SMC_CSCTRL2_WREN_Msk                                           /*!<Write enable bit                       */
#define SMC_CSCTRL2_WAITEN_Pos                                      (13U)
#define SMC_CSCTRL2_WAITEN_Msk                                      (0x1UL << SMC_CSCTRL2_WAITEN_Pos)                              /*!< 0x00002000 */
#define SMC_CSCTRL2_WAITEN                                          SMC_CSCTRL2_WAITEN_Msk                                         /*!<Wait enable bit                        */
#define SMC_CSCTRL2_EXTMODEEN_Pos                                   (14U)
#define SMC_CSCTRL2_EXTMODEEN_Msk                                   (0x1UL << SMC_CSCTRL2_EXTMODEEN_Pos)                           /*!< 0x00004000 */
#define SMC_CSCTRL2_EXTMODEEN                                       SMC_CSCTRL2_EXTMODEEN_Msk                                      /*!<Extended mode enable                   */
#define SMC_CSCTRL2_WSASYNCEN_Pos                                   (15U)
#define SMC_CSCTRL2_WSASYNCEN_Msk                                   (0x1UL << SMC_CSCTRL2_WSASYNCEN_Pos)                           /*!< 0x00008000 */
#define SMC_CSCTRL2_WSASYNCEN                                       SMC_CSCTRL2_WSASYNCEN_Msk                                      /*!<Asynchronous wait                      */
#define SMC_CSCTRL2_CRAMPSIZECFG_Pos                                (16U)
#define SMC_CSCTRL2_CRAMPSIZECFG_Msk                                (0x7UL << SMC_CSCTRL2_CRAMPSIZECFG_Pos)                        /*!< 0x00070000 */
#define SMC_CSCTRL2_CRAMPSIZECFG                                    SMC_CSCTRL2_CRAMPSIZECFG_Msk                                   /*!<CRAM page size */
#define SMC_CSCTRL2_CRAMPSIZECFG_0                                  (0x1UL << SMC_CSCTRL2_CRAMPSIZECFG_Pos)                        /*!< 0x00010000 */
#define SMC_CSCTRL2_CRAMPSIZECFG_1                                  (0x2UL << SMC_CSCTRL2_CRAMPSIZECFG_Pos)                        /*!< 0x00020000 */
#define SMC_CSCTRL2_CRAMPSIZECFG_2                                  (0x4UL << SMC_CSCTRL2_CRAMPSIZECFG_Pos)                        /*!< 0x00040000 */
#define SMC_CSCTRL2_WRBURSTEN_Pos                                   (19U)
#define SMC_CSCTRL2_WRBURSTEN_Msk                                   (0x1UL << SMC_CSCTRL2_WRBURSTEN_Pos)                           /*!< 0x00080000 */
#define SMC_CSCTRL2_WRBURSTEN                                       SMC_CSCTRL2_WRBURSTEN_Msk                                      /*!<Write burst enable                     */

/******************  Bit definition for SMC_CSCTRL3 register  *******************/
#define SMC_CSCTRL3_MBKEN_Pos                                       (0U)
#define SMC_CSCTRL3_MBKEN_Msk                                       (0x1UL << SMC_CSCTRL3_MBKEN_Pos)                               /*!< 0x00000001 */
#define SMC_CSCTRL3_MBKEN                                           SMC_CSCTRL3_MBKEN_Msk                                          /*!<Memory bank enable bit                 */
#define SMC_CSCTRL3_ADMUXEN_Pos                                     (1U)
#define SMC_CSCTRL3_ADMUXEN_Msk                                     (0x1UL << SMC_CSCTRL3_ADMUXEN_Pos)                             /*!< 0x00000002 */
#define SMC_CSCTRL3_ADMUXEN                                         SMC_CSCTRL3_ADMUXEN_Msk                                        /*!<Address/data multiplexing enable bit   */

