betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
#define SMC_CSCTRL3_MTYPECFG_Pos                                    (2U)
#define SMC_CSCTRL3_MTYPECFG_Msk                                    (0x3UL << SMC_CSCTRL3_MTYPECFG_Pos)                            /*!< 0x0000000C */
#define SMC_CSCTRL3_MTYPECFG                                        SMC_CSCTRL3_MTYPECFG_Msk                                       /*!<MTYP[1:0] bits (Memory type)           */
#define SMC_CSCTRL3_MTYPECFG_0                                      (0x1UL << SMC_CSCTRL3_MTYPECFG_Pos)                            /*!< 0x00000004 */
#define SMC_CSCTRL3_MTYPECFG_1                                      (0x2UL << SMC_CSCTRL3_MTYPECFG_Pos)                            /*!< 0x00000008 */

#define SMC_CSCTRL3_MDBWIDCFG_Pos                                   (4U)
#define SMC_CSCTRL3_MDBWIDCFG_Msk                                   (0x3UL << SMC_CSCTRL3_MDBWIDCFG_Pos)                           /*!< 0x00000030 */
#define SMC_CSCTRL3_MDBWIDCFG                                       SMC_CSCTRL3_MDBWIDCFG_Msk                                      /*!<MWID[1:0] bits (Memory data bus width) */
#define SMC_CSCTRL3_MDBWIDCFG_0                                     (0x1UL << SMC_CSCTRL3_MDBWIDCFG_Pos)                           /*!< 0x00000010 */
#define SMC_CSCTRL3_MDBWIDCFG_1                                     (0x2UL << SMC_CSCTRL3_MDBWIDCFG_Pos)                           /*!< 0x00000020 */

#define SMC_CSCTRL3_NORFMACCEN_Pos                                  (6U)
#define SMC_CSCTRL3_NORFMACCEN_Msk                                  (0x1UL << SMC_CSCTRL3_NORFMACCEN_Pos)                          /*!< 0x00000040 */
#define SMC_CSCTRL3_NORFMACCEN                                      SMC_CSCTRL3_NORFMACCEN_Msk                                     /*!<Flash access enable                    */
#define SMC_CSCTRL3_BURSTEN_Pos                                     (8U)
#define SMC_CSCTRL3_BURSTEN_Msk                                     (0x1UL << SMC_CSCTRL3_BURSTEN_Pos)                             /*!< 0x00000100 */
#define SMC_CSCTRL3_BURSTEN                                         SMC_CSCTRL3_BURSTEN_Msk                                        /*!<Burst enable bit                       */
#define SMC_CSCTRL3_WSPOLCFG_Pos                                    (9U)
#define SMC_CSCTRL3_WSPOLCFG_Msk                                    (0x1UL << SMC_CSCTRL3_WSPOLCFG_Pos)                            /*!< 0x00000200 */
#define SMC_CSCTRL3_WSPOLCFG                                        SMC_CSCTRL3_WSPOLCFG_Msk                                       /*!<Wait signal polarity bit               */
#define SMC_CSCTRL3_WRAPBEN_Pos                                     (10U)
#define SMC_CSCTRL3_WRAPBEN_Msk                                     (0x1UL << SMC_CSCTRL3_WRAPBEN_Pos)                             /*!< 0x00000400 */
#define SMC_CSCTRL3_WRAPBEN                                         SMC_CSCTRL3_WRAPBEN_Msk                                        /*!<Wrapped burst mode support             */
#define SMC_CSCTRL3_WTIMCFG_Pos                                     (11U)
#define SMC_CSCTRL3_WTIMCFG_Msk                                     (0x1UL << SMC_CSCTRL3_WTIMCFG_Pos)                             /*!< 0x00000800 */
#define SMC_CSCTRL3_WTIMCFG                                         SMC_CSCTRL3_WTIMCFG_Msk                                        /*!<Wait timing configuration              */
#define SMC_CSCTRL3_WREN_Pos                                        (12U)
#define SMC_CSCTRL3_WREN_Msk                                        (0x1UL << SMC_CSCTRL3_WREN_Pos)                                /*!< 0x00001000 */
#define SMC_CSCTRL3_WREN                                            SMC_CSCTRL3_WREN_Msk                                           /*!<Write enable bit                       */
#define SMC_CSCTRL3_WAITEN_Pos                                      (13U)
#define SMC_CSCTRL3_WAITEN_Msk                                      (0x1UL << SMC_CSCTRL3_WAITEN_Pos)                              /*!< 0x00002000 */
#define SMC_CSCTRL3_WAITEN                                          SMC_CSCTRL3_WAITEN_Msk                                         /*!<Wait enable bit                        */
#define SMC_CSCTRL3_EXTMODEEN_Pos                                   (14U)
#define SMC_CSCTRL3_EXTMODEEN_Msk                                   (0x1UL << SMC_CSCTRL3_EXTMODEEN_Pos)                           /*!< 0x00004000 */
#define SMC_CSCTRL3_EXTMODEEN                                       SMC_CSCTRL3_EXTMODEEN_Msk                                      /*!<Extended mode enable                   */
#define SMC_CSCTRL3_WSASYNCEN_Pos                                   (15U)
#define SMC_CSCTRL3_WSASYNCEN_Msk                                   (0x1UL << SMC_CSCTRL3_WSASYNCEN_Pos)                           /*!< 0x00008000 */
#define SMC_CSCTRL3_WSASYNCEN                                       SMC_CSCTRL3_WSASYNCEN_Msk                                      /*!<Asynchronous wait                      */
#define SMC_CSCTRL3_CRAMPSIZECFG_Pos                                (16U)
#define SMC_CSCTRL3_CRAMPSIZECFG_Msk                                (0x7UL << SMC_CSCTRL3_CRAMPSIZECFG_Pos)                        /*!< 0x00070000 */
#define SMC_CSCTRL3_CRAMPSIZECFG                                    SMC_CSCTRL3_CRAMPSIZECFG_Msk                                   /*!<CRAM page size */
#define SMC_CSCTRL3_CRAMPSIZECFG_0                                  (0x1UL << SMC_CSCTRL3_CRAMPSIZECFG_Pos)                        /*!< 0x00010000 */
#define SMC_CSCTRL3_CRAMPSIZECFG_1                                  (0x2UL << SMC_CSCTRL3_CRAMPSIZECFG_Pos)                        /*!< 0x00020000 */
#define SMC_CSCTRL3_CRAMPSIZECFG_2                                  (0x4UL << SMC_CSCTRL3_CRAMPSIZECFG_Pos)                        /*!< 0x00040000 */
#define SMC_CSCTRL3_WRBURSTEN_Pos                                   (19U)
#define SMC_CSCTRL3_WRBURSTEN_Msk                                   (0x1UL << SMC_CSCTRL3_WRBURSTEN_Pos)                           /*!< 0x00080000 */
#define SMC_CSCTRL3_WRBURSTEN                                       SMC_CSCTRL3_WRBURSTEN_Msk                                      /*!<Write burst enable                     */

/******************  Bit definition for SMC_CSCTRL4 register  *******************/
#define SMC_CSCTRL4_MBKEN_Pos                                       (0U)
#define SMC_CSCTRL4_MBKEN_Msk                                       (0x1UL << SMC_CSCTRL4_MBKEN_Pos)                               /*!< 0x00000001 */
#define SMC_CSCTRL4_MBKEN                                           SMC_CSCTRL4_MBKEN_Msk                                          /*!<Memory bank enable bit */
#define SMC_CSCTRL4_ADMUXEN_Pos                                     (1U)
#define SMC_CSCTRL4_ADMUXEN_Msk                                     (0x1UL << SMC_CSCTRL4_ADMUXEN_Pos)                             /*!< 0x00000002 */
#define SMC_CSCTRL4_ADMUXEN                                         SMC_CSCTRL4_ADMUXEN_Msk                                        /*!<Address/data multiplexing enable bit   */

#define SMC_CSCTRL4_MTYPECFG_Pos                                    (2U)
#define SMC_CSCTRL4_MTYPECFG_Msk                                    (0x3UL << SMC_CSCTRL4_MTYPECFG_Pos)                            /*!< 0x0000000C */
#define SMC_CSCTRL4_MTYPECFG                                        SMC_CSCTRL4_MTYPECFG_Msk                                       /*!<MTYP[1:0] bits (Memory type)           */
#define SMC_CSCTRL4_MTYPECFG_0                                      (0x1UL << SMC_CSCTRL4_MTYPECFG_Pos)                            /*!< 0x00000004 */
#define SMC_CSCTRL4_MTYPECFG_1                                      (0x2UL << SMC_CSCTRL4_MTYPECFG_Pos)                            /*!< 0x00000008 */

#define SMC_CSCTRL4_MDBWIDCFG_Pos                                   (4U)
#define SMC_CSCTRL4_MDBWIDCFG_Msk                                   (0x3UL << SMC_CSCTRL4_MDBWIDCFG_Pos)                           /*!< 0x00000030 */
#define SMC_CSCTRL4_MDBWIDCFG                                       SMC_CSCTRL4_MDBWIDCFG_Msk                                      /*!<MWID[1:0] bits (Memory data bus width) */
#define SMC_CSCTRL4_MDBWIDCFG_0                                     (0x1UL << SMC_CSCTRL4_MDBWIDCFG_Pos)                           /*!< 0x00000010 */
#define SMC_CSCTRL4_MDBWIDCFG_1                                     (0x2UL << SMC_CSCTRL4_MDBWIDCFG_Pos)                           /*!< 0x00000020 */

#define SMC_CSCTRL4_NORFMACCEN_Pos                                  (6U)
#define SMC_CSCTRL4_NORFMACCEN_Msk                                  (0x1UL << SMC_CSCTRL4_NORFMACCEN_Pos)                          /*!< 0x00000040 */
#define SMC_CSCTRL4_NORFMACCEN                                      SMC_CSCTRL4_NORFMACCEN_Msk                                     /*!<Flash access enable                    */
#define SMC_CSCTRL4_BURSTEN_Pos                                     (8U)
#define SMC_CSCTRL4_BURSTEN_Msk                                     (0x1UL << SMC_CSCTRL4_BURSTEN_Pos)                             /*!< 0x00000100 */
#define SMC_CSCTRL4_BURSTEN                                         SMC_CSCTRL4_BURSTEN_Msk                                        /*!<Burst enable bit                       */
#define SMC_CSCTRL4_WSPOLCFG_Pos                                    (9U)
#define SMC_CSCTRL4_WSPOLCFG_Msk                                    (0x1UL << SMC_CSCTRL4_WSPOLCFG_Pos)                            /*!< 0x00000200 */
#define SMC_CSCTRL4_WSPOLCFG                                        SMC_CSCTRL4_WSPOLCFG_Msk                                       /*!<Wait signal polarity bit               */
#define SMC_CSCTRL4_WRAPBEN_Pos                                     (10U)
#define SMC_CSCTRL4_WRAPBEN_Msk                                     (0x1UL << SMC_CSCTRL4_WRAPBEN_Pos)                             /*!< 0x00000400 */
#define SMC_CSCTRL4_WRAPBEN                                         SMC_CSCTRL4_WRAPBEN_Msk                                        /*!<Wrapped burst mode support             */
#define SMC_CSCTRL4_WTIMCFG_Pos                                     (11U)
#define SMC_CSCTRL4_WTIMCFG_Msk                                     (0x1UL << SMC_CSCTRL4_WTIMCFG_Pos)                             /*!< 0x00000800 */
#define SMC_CSCTRL4_WTIMCFG                                         SMC_CSCTRL4_WTIMCFG_Msk                                        /*!<Wait timing configuration              */
#define SMC_CSCTRL4_WREN_Pos                                        (12U)
#define SMC_CSCTRL4_WREN_Msk                                        (0x1UL << SMC_CSCTRL4_WREN_Pos)                                /*!< 0x00001000 */
#define SMC_CSCTRL4_WREN                                            SMC_CSCTRL4_WREN_Msk                                           /*!<Write enable bit                       */
#define SMC_CSCTRL4_WAITEN_Pos                                      (13U)
#define SMC_CSCTRL4_WAITEN_Msk                                      (0x1UL << SMC_CSCTRL4_WAITEN_Pos)                              /*!< 0x00002000 */
#define SMC_CSCTRL4_WAITEN                                          SMC_CSCTRL4_WAITEN_Msk                                         /*!<Wait enable bit                        */
#define SMC_CSCTRL4_EXTMODEEN_Pos                                   (14U)
#define SMC_CSCTRL4_EXTMODEEN_Msk                                   (0x1UL << SMC_CSCTRL4_EXTMODEEN_Pos)                           /*!< 0x00004000 */
#define SMC_CSCTRL4_EXTMODEEN                                       SMC_CSCTRL4_EXTMODEEN_Msk                                      /*!<Extended mode enable                   */
#define SMC_CSCTRL4_WSASYNCEN_Pos                                   (15U)
#define SMC_CSCTRL4_WSASYNCEN_Msk                                   (0x1UL << SMC_CSCTRL4_WSASYNCEN_Pos)                           /*!< 0x00008000 */
#define SMC_CSCTRL4_WSASYNCEN                                       SMC_CSCTRL4_WSASYNCEN_Msk                                      /*!<Asynchronous wait                      */
#define SMC_CSCTRL4_CRAMPSIZECFG_Pos                                (16U)
#define SMC_CSCTRL4_CRAMPSIZECFG_Msk                                (0x7UL << SMC_CSCTRL4_CRAMPSIZECFG_Pos)                        /*!< 0x00070000 */
#define SMC_CSCTRL4_CRAMPSIZECFG                                    SMC_CSCTRL4_CRAMPSIZECFG_Msk                                   /*!<CRAM page size */
#define SMC_CSCTRL4_CRAMPSIZECFG_0                                  (0x1UL << SMC_CSCTRL4_CRAMPSIZECFG_Pos)                        /*!< 0x00010000 */
#define SMC_CSCTRL4_CRAMPSIZECFG_1                                  (0x2UL << SMC_CSCTRL4_CRAMPSIZECFG_Pos)                        /*!< 0x00020000 */
#define SMC_CSCTRL4_CRAMPSIZECFG_2                                  (0x4UL << SMC_CSCTRL4_CRAMPSIZECFG_Pos)                        /*!< 0x00040000 */
#define SMC_CSCTRL4_WRBURSTEN_Pos                                   (19U)
#define SMC_CSCTRL4_WRBURSTEN_Msk                                   (0x1UL << SMC_CSCTRL4_WRBURSTEN_Pos)                           /*!< 0x00080000 */
#define SMC_CSCTRL4_WRBURSTEN                                       SMC_CSCTRL4_WRBURSTEN_Msk                                      /*!<Write burst enable                     */

