betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
#define SMC_CTRL3_DBWIDCFG_Pos                                      (4U)
#define SMC_CTRL3_DBWIDCFG_Msk                                      (0x3UL << SMC_CTRL3_DBWIDCFG_Pos)                              /*!< 0x00000030 */
#define SMC_CTRL3_DBWIDCFG                                          SMC_CTRL3_DBWIDCFG_Msk                                         /*!<PWID[1:0] bits (NAND Flash databus width) */
#define SMC_CTRL3_DBWIDCFG_0                                        (0x1UL << SMC_CTRL3_DBWIDCFG_Pos)                              /*!< 0x00000010 */
#define SMC_CTRL3_DBWIDCFG_1                                        (0x2UL << SMC_CTRL3_DBWIDCFG_Pos)                              /*!< 0x00000020 */

#define SMC_CTRL3_ECCEN_Pos                                         (6U)
#define SMC_CTRL3_ECCEN_Msk                                         (0x1UL << SMC_CTRL3_ECCEN_Pos)                                 /*!< 0x00000040 */
#define SMC_CTRL3_ECCEN                                             SMC_CTRL3_ECCEN_Msk                                            /*!<ECC computation logic enable bit */

#define SMC_CTRL3_C2RDCFG_Pos                                       (9U)
#define SMC_CTRL3_C2RDCFG_Msk                                       (0xFUL << SMC_CTRL3_C2RDCFG_Pos)                               /*!< 0x00001E00 */
#define SMC_CTRL3_C2RDCFG                                           SMC_CTRL3_C2RDCFG_Msk                                          /*!<TCLR[3:0] bits (CLE to RE delay) */
#define SMC_CTRL3_C2RDCFG_0                                         (0x1UL << SMC_CTRL3_C2RDCFG_Pos)                               /*!< 0x00000200 */
#define SMC_CTRL3_C2RDCFG_1                                         (0x2UL << SMC_CTRL3_C2RDCFG_Pos)                               /*!< 0x00000400 */
#define SMC_CTRL3_C2RDCFG_2                                         (0x4UL << SMC_CTRL3_C2RDCFG_Pos)                               /*!< 0x00000800 */
#define SMC_CTRL3_C2RDCFG_3                                         (0x8UL << SMC_CTRL3_C2RDCFG_Pos)                               /*!< 0x00001000 */

#define SMC_CTRL3_A2RDCFG_Pos                                       (13U)
#define SMC_CTRL3_A2RDCFG_Msk                                       (0xFUL << SMC_CTRL3_A2RDCFG_Pos)                               /*!< 0x0001E000 */
#define SMC_CTRL3_A2RDCFG                                           SMC_CTRL3_A2RDCFG_Msk                                          /*!<TAR[3:0] bits (ALE to RE delay) */
#define SMC_CTRL3_A2RDCFG_0                                         (0x1UL << SMC_CTRL3_A2RDCFG_Pos)                               /*!< 0x00002000 */
#define SMC_CTRL3_A2RDCFG_1                                         (0x2UL << SMC_CTRL3_A2RDCFG_Pos)                               /*!< 0x00004000 */
#define SMC_CTRL3_A2RDCFG_2                                         (0x4UL << SMC_CTRL3_A2RDCFG_Pos)                               /*!< 0x00008000 */
#define SMC_CTRL3_A2RDCFG_3                                         (0x8UL << SMC_CTRL3_A2RDCFG_Pos)                               /*!< 0x00010000 */

#define SMC_CTRL3_ECCPSCFG_Pos                                      (17U)
#define SMC_CTRL3_ECCPSCFG_Msk                                      (0x7UL << SMC_CTRL3_ECCPSCFG_Pos)                              /*!< 0x000E0000 */
#define SMC_CTRL3_ECCPSCFG                                          SMC_CTRL3_ECCPSCFG_Msk                                         /*!<ECCPS[2:0] bits (ECC page size) */
#define SMC_CTRL3_ECCPSCFG_0                                        (0x1UL << SMC_CTRL3_ECCPSCFG_Pos)                              /*!< 0x00020000 */
#define SMC_CTRL3_ECCPSCFG_1                                        (0x2UL << SMC_CTRL3_ECCPSCFG_Pos)                              /*!< 0x00040000 */
#define SMC_CTRL3_ECCPSCFG_2                                        (0x4UL << SMC_CTRL3_ECCPSCFG_Pos)                              /*!< 0x00080000 */

/******************  Bit definition for SMC_CTRL4 register  *******************/
#define SMC_CTRL4_WAITFEN_Pos                                       (1U)
#define SMC_CTRL4_WAITFEN_Msk                                       (0x1UL << SMC_CTRL4_WAITFEN_Pos)                               /*!< 0x00000002 */
#define SMC_CTRL4_WAITFEN                                           SMC_CTRL4_WAITFEN_Msk                                          /*!<Wait feature enable bit */
#define SMC_CTRL4_MBKEN_Pos                                         (2U)
#define SMC_CTRL4_MBKEN_Msk                                         (0x1UL << SMC_CTRL4_MBKEN_Pos)                                 /*!< 0x00000004 */
#define SMC_CTRL4_MBKEN                                             SMC_CTRL4_MBKEN_Msk                                            /*!<PC Card/NAND Flash memory bank enable bit */
#define SMC_CTRL4_MTYPECFG_Pos                                      (3U)
#define SMC_CTRL4_MTYPECFG_Msk                                      (0x1UL << SMC_CTRL4_MTYPECFG_Pos)                              /*!< 0x00000008 */
#define SMC_CTRL4_MTYPECFG                                          SMC_CTRL4_MTYPECFG_Msk                                         /*!<Memory type */

#define SMC_CTRL4_DBWIDCFG_Pos                                      (4U)
#define SMC_CTRL4_DBWIDCFG_Msk                                      (0x3UL << SMC_CTRL4_DBWIDCFG_Pos)                              /*!< 0x00000030 */
#define SMC_CTRL4_DBWIDCFG                                          SMC_CTRL4_DBWIDCFG_Msk                                         /*!<PWID[1:0] bits (NAND Flash databus width) */
#define SMC_CTRL4_DBWIDCFG_0                                        (0x1UL << SMC_CTRL4_DBWIDCFG_Pos)                              /*!< 0x00000010 */
#define SMC_CTRL4_DBWIDCFG_1                                        (0x2UL << SMC_CTRL4_DBWIDCFG_Pos)                              /*!< 0x00000020 */

#define SMC_CTRL4_ECCEN_Pos                                         (6U)
#define SMC_CTRL4_ECCEN_Msk                                         (0x1UL << SMC_CTRL4_ECCEN_Pos)                                 /*!< 0x00000040 */
#define SMC_CTRL4_ECCEN                                             SMC_CTRL4_ECCEN_Msk                                            /*!<ECC computation logic enable bit */

#define SMC_CTRL4_C2RDCFG_Pos                                       (9U)
#define SMC_CTRL4_C2RDCFG_Msk                                       (0xFUL << SMC_CTRL4_C2RDCFG_Pos)                               /*!< 0x00001E00 */
#define SMC_CTRL4_C2RDCFG                                           SMC_CTRL4_C2RDCFG_Msk                                          /*!<TCLR[3:0] bits (CLE to RE delay) */
#define SMC_CTRL4_C2RDCFG_0                                         (0x1UL << SMC_CTRL4_C2RDCFG_Pos)                               /*!< 0x00000200 */
#define SMC_CTRL4_C2RDCFG_1                                         (0x2UL << SMC_CTRL4_C2RDCFG_Pos)                               /*!< 0x00000400 */
#define SMC_CTRL4_C2RDCFG_2                                         (0x4UL << SMC_CTRL4_C2RDCFG_Pos)                               /*!< 0x00000800 */
#define SMC_CTRL4_C2RDCFG_3                                         (0x8UL << SMC_CTRL4_C2RDCFG_Pos)                               /*!< 0x00001000 */

#define SMC_CTRL4_A2RDCFG_Pos                                       (13U)
#define SMC_CTRL4_A2RDCFG_Msk                                       (0xFUL << SMC_CTRL4_A2RDCFG_Pos)                               /*!< 0x0001E000 */
#define SMC_CTRL4_A2RDCFG                                           SMC_CTRL4_A2RDCFG_Msk                                          /*!<TAR[3:0] bits (ALE to RE delay) */
#define SMC_CTRL4_A2RDCFG_0                                         (0x1UL << SMC_CTRL4_A2RDCFG_Pos)                               /*!< 0x00002000 */
#define SMC_CTRL4_A2RDCFG_1                                         (0x2UL << SMC_CTRL4_A2RDCFG_Pos)                               /*!< 0x00004000 */
#define SMC_CTRL4_A2RDCFG_2                                         (0x4UL << SMC_CTRL4_A2RDCFG_Pos)                               /*!< 0x00008000 */
#define SMC_CTRL4_A2RDCFG_3                                         (0x8UL << SMC_CTRL4_A2RDCFG_Pos)                               /*!< 0x00010000 */

#define SMC_CTRL4_ECCPSCFG_Pos                                      (17U)
#define SMC_CTRL4_ECCPSCFG_Msk                                      (0x7UL << SMC_CTRL4_ECCPSCFG_Pos)                              /*!< 0x000E0000 */
#define SMC_CTRL4_ECCPSCFG                                          SMC_CTRL4_ECCPSCFG_Msk                                         /*!<ECCPS[2:0] bits (ECC page size) */
#define SMC_CTRL4_ECCPSCFG_0                                        (0x1UL << SMC_CTRL4_ECCPSCFG_Pos)                              /*!< 0x00020000 */
#define SMC_CTRL4_ECCPSCFG_1                                        (0x2UL << SMC_CTRL4_ECCPSCFG_Pos)                              /*!< 0x00040000 */
#define SMC_CTRL4_ECCPSCFG_2                                        (0x4UL << SMC_CTRL4_ECCPSCFG_Pos)                              /*!< 0x00080000 */

/*******************  Bit definition for SMC_STSINT2 register  *******************/
#define SMC_STSINT2_IREFLG_Pos                                      (0U)
#define SMC_STSINT2_IREFLG_Msk                                      (0x1UL << SMC_STSINT2_IREFLG_Pos)                              /*!< 0x00000001 */
#define SMC_STSINT2_IREFLG                                          SMC_STSINT2_IREFLG_Msk                                         /*!<Interrupt Rising Edge status                */
#define SMC_STSINT2_IHLFLG_Pos                                      (1U)
#define SMC_STSINT2_IHLFLG_Msk                                      (0x1UL << SMC_STSINT2_IHLFLG_Pos)                              /*!< 0x00000002 */
#define SMC_STSINT2_IHLFLG                                          SMC_STSINT2_IHLFLG_Msk                                         /*!<Interrupt Level status                      */
#define SMC_STSINT2_IFEFLG_Pos                                      (2U)
#define SMC_STSINT2_IFEFLG_Msk                                      (0x1UL << SMC_STSINT2_IFEFLG_Pos)                              /*!< 0x00000004 */
#define SMC_STSINT2_IFEFLG                                          SMC_STSINT2_IFEFLG_Msk                                         /*!<Interrupt Falling Edge status               */
#define SMC_STSINT2_IREDEN_Pos                                      (3U)
#define SMC_STSINT2_IREDEN_Msk                                      (0x1UL << SMC_STSINT2_IREDEN_Pos)                              /*!< 0x00000008 */
#define SMC_STSINT2_IREDEN                                          SMC_STSINT2_IREDEN_Msk                                         /*!<Interrupt Rising Edge detection Enable bit  */
#define SMC_STSINT2_IHLDEN_Pos                                      (4U)
#define SMC_STSINT2_IHLDEN_Msk                                      (0x1UL << SMC_STSINT2_IHLDEN_Pos)                              /*!< 0x00000010 */
#define SMC_STSINT2_IHLDEN                                          SMC_STSINT2_IHLDEN_Msk                                         /*!<Interrupt Level detection Enable bit        */
#define SMC_STSINT2_IFEDEN_Pos                                      (5U)
#define SMC_STSINT2_IFEDEN_Msk                                      (0x1UL << SMC_STSINT2_IFEDEN_Pos)                              /*!< 0x00000020 */
#define SMC_STSINT2_IFEDEN                                          SMC_STSINT2_IFEDEN_Msk                                         /*!<Interrupt Falling Edge detection Enable bit */
#define SMC_STSINT2_FEFLG_Pos                                       (6U)
#define SMC_STSINT2_FEFLG_Msk                                       (0x1UL << SMC_STSINT2_FEFLG_Pos)                               /*!< 0x00000040 */
#define SMC_STSINT2_FEFLG                                           SMC_STSINT2_FEFLG_Msk                                          /*!<FIFO empty */

