betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_LPAPB2_SUPPORT

/********************  Bit definition for RCM_LPAPB2CLKEN register  *************/
#define RCM_LPAPB2CLKEN_TMR1EN_Pos                                  (0U)
#define RCM_LPAPB2CLKEN_TMR1EN_Msk                                  (0x1UL << RCM_LPAPB2CLKEN_TMR1EN_Pos)                          /*!< 0x00000001 */
#define RCM_LPAPB2CLKEN_TMR1EN                                      RCM_LPAPB2CLKEN_TMR1EN_Msk
#define RCM_LPAPB2CLKEN_TMR8EN_Pos                                  (1U)
#define RCM_LPAPB2CLKEN_TMR8EN_Msk                                  (0x1UL << RCM_LPAPB2CLKEN_TMR8EN_Pos)                          /*!< 0x00000002 */
#define RCM_LPAPB2CLKEN_TMR8EN                                      RCM_LPAPB2CLKEN_TMR8EN_Msk
#define RCM_LPAPB2CLKEN_USART1EN_Pos                                (4U)
#define RCM_LPAPB2CLKEN_USART1EN_Msk                                (0x1UL << RCM_LPAPB2CLKEN_USART1EN_Pos)                        /*!< 0x00000010 */
#define RCM_LPAPB2CLKEN_USART1EN                                    RCM_LPAPB2CLKEN_USART1EN_Msk
#define RCM_LPAPB2CLKEN_USART6EN_Pos                                (5U)
#define RCM_LPAPB2CLKEN_USART6EN_Msk                                (0x1UL << RCM_LPAPB2CLKEN_USART6EN_Pos)                        /*!< 0x00000020 */
#define RCM_LPAPB2CLKEN_USART6EN                                    RCM_LPAPB2CLKEN_USART6EN_Msk
#define RCM_LPAPB2CLKEN_ADC1EN_Pos                                  (8U)
#define RCM_LPAPB2CLKEN_ADC1EN_Msk                                  (0x1UL << RCM_LPAPB2CLKEN_ADC1EN_Pos)                          /*!< 0x00000100 */
#define RCM_LPAPB2CLKEN_ADC1EN                                      RCM_LPAPB2CLKEN_ADC1EN_Msk
#define RCM_LPAPB2CLKEN_ADC2EN_Pos                                  (9U)
#define RCM_LPAPB2CLKEN_ADC2EN_Msk                                  (0x1UL << RCM_LPAPB2CLKEN_ADC2EN_Pos)                          /*!< 0x00000200 */
#define RCM_LPAPB2CLKEN_ADC2EN                                      RCM_LPAPB2CLKEN_ADC2EN_Msk
#define RCM_LPAPB2CLKEN_ADC3EN_Pos                                  (10U)
#define RCM_LPAPB2CLKEN_ADC3EN_Msk                                  (0x1UL << RCM_LPAPB2CLKEN_ADC3EN_Pos)                          /*!< 0x00000400 */
#define RCM_LPAPB2CLKEN_ADC3EN                                      RCM_LPAPB2CLKEN_ADC3EN_Msk
#define RCM_LPAPB2CLKEN_SDIOEN_Pos                                  (11U)
#define RCM_LPAPB2CLKEN_SDIOEN_Msk                                  (0x1UL << RCM_LPAPB2CLKEN_SDIOEN_Pos)                          /*!< 0x00000800 */
#define RCM_LPAPB2CLKEN_SDIOEN                                      RCM_LPAPB2CLKEN_SDIOEN_Msk
#define RCM_LPAPB2CLKEN_SPI1EN_Pos                                  (12U)
#define RCM_LPAPB2CLKEN_SPI1EN_Msk                                  (0x1UL << RCM_LPAPB2CLKEN_SPI1EN_Pos)                          /*!< 0x00001000 */
#define RCM_LPAPB2CLKEN_SPI1EN                                      RCM_LPAPB2CLKEN_SPI1EN_Msk
#define RCM_LPAPB2CLKEN_SYSCFGEN_Pos                                (14U)
#define RCM_LPAPB2CLKEN_SYSCFGEN_Msk                                (0x1UL << RCM_LPAPB2CLKEN_SYSCFGEN_Pos)                        /*!< 0x00004000 */
#define RCM_LPAPB2CLKEN_SYSCFGEN                                    RCM_LPAPB2CLKEN_SYSCFGEN_Msk
#define RCM_LPAPB2CLKEN_TMR9EN_Pos                                  (16U)
#define RCM_LPAPB2CLKEN_TMR9EN_Msk                                  (0x1UL << RCM_LPAPB2CLKEN_TMR9EN_Pos)                          /*!< 0x00010000 */
#define RCM_LPAPB2CLKEN_TMR9EN                                      RCM_LPAPB2CLKEN_TMR9EN_Msk
#define RCM_LPAPB2CLKEN_TMR10EN_Pos                                 (17U)
#define RCM_LPAPB2CLKEN_TMR10EN_Msk                                 (0x1UL << RCM_LPAPB2CLKEN_TMR10EN_Pos)                         /*!< 0x00020000 */
#define RCM_LPAPB2CLKEN_TMR10EN                                     RCM_LPAPB2CLKEN_TMR10EN_Msk
#define RCM_LPAPB2CLKEN_TMR11EN_Pos                                 (18U)
#define RCM_LPAPB2CLKEN_TMR11EN_Msk                                 (0x1UL << RCM_LPAPB2CLKEN_TMR11EN_Pos)                         /*!< 0x00040000 */
#define RCM_LPAPB2CLKEN_TMR11EN                                     RCM_LPAPB2CLKEN_TMR11EN_Msk

/********************  Bit definition for RCM_BDCTRL register  ******************/
#define RCM_BDCTRL_LSEEN_Pos                                        (0U)
#define RCM_BDCTRL_LSEEN_Msk                                        (0x1UL << RCM_BDCTRL_LSEEN_Pos)                                /*!< 0x00000001 */
#define RCM_BDCTRL_LSEEN                                            RCM_BDCTRL_LSEEN_Msk
#define RCM_BDCTRL_LSERDYFLG_Pos                                    (1U)
#define RCM_BDCTRL_LSERDYFLG_Msk                                    (0x1UL << RCM_BDCTRL_LSERDYFLG_Pos)                            /*!< 0x00000002 */
#define RCM_BDCTRL_LSERDYFLG                                        RCM_BDCTRL_LSERDYFLG_Msk
#define RCM_BDCTRL_LSEBCFG_Pos                                      (2U)
#define RCM_BDCTRL_LSEBCFG_Msk                                      (0x1UL << RCM_BDCTRL_LSEBCFG_Pos)                              /*!< 0x00000004 */
#define RCM_BDCTRL_LSEBCFG                                          RCM_BDCTRL_LSEBCFG_Msk

#define RCM_BDCTRL_RTCSRCSEL_Pos                                    (8U)
#define RCM_BDCTRL_RTCSRCSEL_Msk                                    (0x3UL << RCM_BDCTRL_RTCSRCSEL_Pos)                            /*!< 0x00000300 */
#define RCM_BDCTRL_RTCSRCSEL                                        RCM_BDCTRL_RTCSRCSEL_Msk
#define RCM_BDCTRL_RTCSRCSEL_0                                      (0x1UL << RCM_BDCTRL_RTCSRCSEL_Pos)                            /*!< 0x00000100 */
#define RCM_BDCTRL_RTCSRCSEL_1                                      (0x2UL << RCM_BDCTRL_RTCSRCSEL_Pos)                            /*!< 0x00000200 */

