betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/*******************  Bit definition for SPI_CRCPOLY register  ******************/
#define SPI_CRCPOLY_CRCPOLY_Pos                                     (0U)
#define SPI_CRCPOLY_CRCPOLY_Msk                                     (0xFFFFUL << SPI_CRCPOLY_CRCPOLY_Pos)                          /*!< 0x0000FFFF */
#define SPI_CRCPOLY_CRCPOLY                                         SPI_CRCPOLY_CRCPOLY_Msk                                        /*!<CRC polynomial register */

/******************  Bit definition for SPI_RXCRC register  ******************/
#define SPI_RXCRC_RXCRC_Pos                                         (0U)
#define SPI_RXCRC_RXCRC_Msk                                         (0xFFFFUL << SPI_RXCRC_RXCRC_Pos)                              /*!< 0x0000FFFF */
#define SPI_RXCRC_RXCRC                                             SPI_RXCRC_RXCRC_Msk                                            /*!<Rx CRC Register         */

/******************  Bit definition for SPI_TXCRC register  ******************/
#define SPI_TXCRC_TXCRC_Pos                                         (0U)
#define SPI_TXCRC_TXCRC_Msk                                         (0xFFFFUL << SPI_TXCRC_TXCRC_Pos)                              /*!< 0x0000FFFF */
#define SPI_TXCRC_TXCRC                                             SPI_TXCRC_TXCRC_Msk                                            /*!<Tx CRC Register         */

/******************  Bit definition for SPI_I2SCFG register  *****************/
#define SPI_I2SCFG_CHLEN_Pos                                        (0U)
#define SPI_I2SCFG_CHLEN_Msk                                        (0x1UL << SPI_I2SCFG_CHLEN_Pos)                                /*!< 0x00000001 */
#define SPI_I2SCFG_CHLEN                                            SPI_I2SCFG_CHLEN_Msk                                           /*!<Channel length (number of bits per audio channel) */

#define SPI_I2SCFG_DATALEN_Pos                                      (1U)
#define SPI_I2SCFG_DATALEN_Msk                                      (0x3UL << SPI_I2SCFG_DATALEN_Pos)                              /*!< 0x00000006 */
#define SPI_I2SCFG_DATALEN                                          SPI_I2SCFG_DATALEN_Msk                                         /*!<DATLEN[1:0] bits (Data length to be transferred)  */
#define SPI_I2SCFG_DATALEN_0                                        (0x1UL << SPI_I2SCFG_DATALEN_Pos)                              /*!< 0x00000002 */
#define SPI_I2SCFG_DATALEN_1                                        (0x2UL << SPI_I2SCFG_DATALEN_Pos)                              /*!< 0x00000004 */

#define SPI_I2SCFG_CPOL_Pos                                         (3U)
#define SPI_I2SCFG_CPOL_Msk                                         (0x1UL << SPI_I2SCFG_CPOL_Pos)                                 /*!< 0x00000008 */
#define SPI_I2SCFG_CPOL                                             SPI_I2SCFG_CPOL_Msk                                            /*!<steady state clock polarity               */

#define SPI_I2SCFG_I2SSSEL_Pos                                      (4U)
#define SPI_I2SCFG_I2SSSEL_Msk                                      (0x3UL << SPI_I2SCFG_I2SSSEL_Pos)                              /*!< 0x00000030 */
#define SPI_I2SCFG_I2SSSEL                                          SPI_I2SCFG_I2SSSEL_Msk                                         /*!<I2SSTD[1:0] bits (I2S standard selection) */
#define SPI_I2SCFG_I2SSSEL_0                                        (0x1UL << SPI_I2SCFG_I2SSSEL_Pos)                              /*!< 0x00000010 */
#define SPI_I2SCFG_I2SSSEL_1                                        (0x2UL << SPI_I2SCFG_I2SSSEL_Pos)                              /*!< 0x00000020 */

#define SPI_I2SCFG_PFSSEL_Pos                                       (7U)
#define SPI_I2SCFG_PFSSEL_Msk                                       (0x1UL << SPI_I2SCFG_PFSSEL_Pos)                               /*!< 0x00000080 */
#define SPI_I2SCFG_PFSSEL                                           SPI_I2SCFG_PFSSEL_Msk                                          /*!<PCM frame synchronization                 */

#define SPI_I2SCFG_I2SMOD_Pos                                       (8U)
#define SPI_I2SCFG_I2SMOD_Msk                                       (0x3UL << SPI_I2SCFG_I2SMOD_Pos)                               /*!< 0x00000300 */
#define SPI_I2SCFG_I2SMOD                                           SPI_I2SCFG_I2SMOD_Msk                                          /*!<I2SCFG[1:0] bits (I2S configuration mode) */
#define SPI_I2SCFG_I2SMOD_0                                         (0x1UL << SPI_I2SCFG_I2SMOD_Pos)                               /*!< 0x00000100 */
#define SPI_I2SCFG_I2SMOD_1                                         (0x2UL << SPI_I2SCFG_I2SMOD_Pos)                               /*!< 0x00000200 */

#define SPI_I2SCFG_I2SEN_Pos                                        (10U)
#define SPI_I2SCFG_I2SEN_Msk                                        (0x1UL << SPI_I2SCFG_I2SEN_Pos)                                /*!< 0x00000400 */
#define SPI_I2SCFG_I2SEN                                            SPI_I2SCFG_I2SEN_Msk                                           /*!<I2S Enable         */
#define SPI_I2SCFG_MODESEL_Pos                                      (11U)
#define SPI_I2SCFG_MODESEL_Msk                                      (0x1UL << SPI_I2SCFG_MODESEL_Pos)                              /*!< 0x00000800 */
#define SPI_I2SCFG_MODESEL                                          SPI_I2SCFG_MODESEL_Msk                                         /*!<I2S mode selection */

/******************  Bit definition for SPI_I2SPSC register  *******************/
#define SPI_I2SPSC_I2SPSC_Pos                                       (0U)
#define SPI_I2SPSC_I2SPSC_Msk                                       (0xFFUL << SPI_I2SPSC_I2SPSC_Pos)                              /*!< 0x000000FF */
#define SPI_I2SPSC_I2SPSC                                           SPI_I2SPSC_I2SPSC_Msk                                          /*!<I2S Linear prescaler         */
#define SPI_I2SPSC_ODDPS_Pos                                        (8U)
#define SPI_I2SPSC_ODDPS_Msk                                        (0x1UL << SPI_I2SPSC_ODDPS_Pos)                                /*!< 0x00000100 */
#define SPI_I2SPSC_ODDPS                                            SPI_I2SPSC_ODDPS_Msk                                           /*!<Odd factor for the prescaler */
#define SPI_I2SPSC_MCOEN_Pos                                        (9U)
#define SPI_I2SPSC_MCOEN_Msk                                        (0x1UL << SPI_I2SPSC_MCOEN_Pos)                                /*!< 0x00000200 */
#define SPI_I2SPSC_MCOEN                                            SPI_I2SPSC_MCOEN_Msk                                           /*!<Master Clock Output Enable   */

/******************************************************************************/
/*                                                                            */
/*                                 SYSCFG                                     */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SYSCFG_MMSEL register  ***************/
#define SYSCFG_MMSEL_MMSEL_Pos                                      (0U)
#define SYSCFG_MMSEL_MMSEL_Msk                                      (0x3UL << SYSCFG_MMSEL_MMSEL_Pos)                              /*!< 0x00000003 */
#define SYSCFG_MMSEL_MMSEL                                          SYSCFG_MMSEL_MMSEL_Msk                                         /*!< SYSCFG_Memory Remap Config */
#define SYSCFG_MMSEL_MMSEL_0                                        (0x1UL << SYSCFG_MMSEL_MMSEL_Pos)                              /*!< 0x00000001 */
#define SYSCFG_MMSEL_MMSEL_1                                        (0x2UL << SYSCFG_MMSEL_MMSEL_Pos)                              /*!< 0x00000002 */
/******************  Bit definition for SYSCFG_PMCFG register  ******************/
#define SYSCFG_PMCFG_ENETSEL_Pos                                    (23U)
#define SYSCFG_PMCFG_ENETSEL_Msk                                    (0x1UL << SYSCFG_PMCFG_ENETSEL_Pos)                            /*!< 0x00800000 */
#define SYSCFG_PMCFG_ENETSEL                                        SYSCFG_PMCFG_ENETSEL_Msk                                       /*!<Ethernet PHY interface selection */
/* Old MII_RMII_SEL bit definition, maintained for legacy purpose */
#define SYSCFG_PMCFG_MII_RMII                                       SYSCFG_PMCFG_ENETSEL

/*****************  Bit definition for SYSCFG_EINTCFG1 register  ***************/
#define SYSCFG_EINTCFG1_EINT0_Pos                                   (0U)
#define SYSCFG_EINTCFG1_EINT0_Msk                                   (0xFUL << SYSCFG_EINTCFG1_EINT0_Pos)                           /*!< 0x0000000F */
#define SYSCFG_EINTCFG1_EINT0                                       SYSCFG_EINTCFG1_EINT0_Msk                                      /*!<EINT 0 configuration */
#define SYSCFG_EINTCFG1_EINT1_Pos                                   (4U)
#define SYSCFG_EINTCFG1_EINT1_Msk                                   (0xFUL << SYSCFG_EINTCFG1_EINT1_Pos)                           /*!< 0x000000F0 */
#define SYSCFG_EINTCFG1_EINT1                                       SYSCFG_EINTCFG1_EINT1_Msk                                      /*!<EINT 1 configuration */
#define SYSCFG_EINTCFG1_EINT2_Pos                                   (8U)
#define SYSCFG_EINTCFG1_EINT2_Msk                                   (0xFUL << SYSCFG_EINTCFG1_EINT2_Pos)                           /*!< 0x00000F00 */
#define SYSCFG_EINTCFG1_EINT2                                       SYSCFG_EINTCFG1_EINT2_Msk                                      /*!<EINT 2 configuration */
#define SYSCFG_EINTCFG1_EINT3_Pos                                   (12U)
#define SYSCFG_EINTCFG1_EINT3_Msk                                   (0xFUL << SYSCFG_EINTCFG1_EINT3_Pos)                           /*!< 0x0000F000 */
#define SYSCFG_EINTCFG1_EINT3                                       SYSCFG_EINTCFG1_EINT3_Msk                                      /*!<EINT 3 configuration */
/**
  * @brief   EINT0 configuration
  */
#define SYSCFG_EINTCFG1_EINT0_PA                                    0x0000U                                                        /*!<PA[0] pin */
#define SYSCFG_EINTCFG1_EINT0_PB                                    0x0001U                                                        /*!<PB[0] pin */
#define SYSCFG_EINTCFG1_EINT0_PC                                    0x0002U                                                        /*!<PC[0] pin */
#define SYSCFG_EINTCFG1_EINT0_PD                                    0x0003U                                                        /*!<PD[0] pin */
#define SYSCFG_EINTCFG1_EINT0_PE                                    0x0004U                                                        /*!<PE[0] pin */
#define SYSCFG_EINTCFG1_EINT0_PF                                    0x0005U                                                        /*!<PF[0] pin */
#define SYSCFG_EINTCFG1_EINT0_PG                                    0x0006U                                                        /*!<PG[0] pin */
#define SYSCFG_EINTCFG1_EINT0_PH                                    0x0007U                                                        /*!<PH[0] pin */
#define SYSCFG_EINTCFG1_EINT0_PI                                    0x0008U                                                        /*!<PI[0] pin */

/**
  * @brief   EINT1 configuration
  */
#define SYSCFG_EINTCFG1_EINT1_PA                                    0x0000U                                                        /*!<PA[1] pin */
#define SYSCFG_EINTCFG1_EINT1_PB                                    0x0010U                                                        /*!<PB[1] pin */
#define SYSCFG_EINTCFG1_EINT1_PC                                    0x0020U                                                        /*!<PC[1] pin */
#define SYSCFG_EINTCFG1_EINT1_PD                                    0x0030U                                                        /*!<PD[1] pin */
#define SYSCFG_EINTCFG1_EINT1_PE                                    0x0040U                                                        /*!<PE[1] pin */
#define SYSCFG_EINTCFG1_EINT1_PF                                    0x0050U                                                        /*!<PF[1] pin */
#define SYSCFG_EINTCFG1_EINT1_PG                                    0x0060U                                                        /*!<PG[1] pin */
#define SYSCFG_EINTCFG1_EINT1_PH                                    0x0070U                                                        /*!<PH[1] pin */
#define SYSCFG_EINTCFG1_EINT1_PI                                    0x0080U                                                        /*!<PI[1] pin */

/**
  * @brief   EINT2 configuration
  */
#define SYSCFG_EINTCFG1_EINT2_PA                                    0x0000U                                                        /*!<PA[2] pin */
#define SYSCFG_EINTCFG1_EINT2_PB                                    0x0100U                                                        /*!<PB[2] pin */
#define SYSCFG_EINTCFG1_EINT2_PC                                    0x0200U                                                        /*!<PC[2] pin */
#define SYSCFG_EINTCFG1_EINT2_PD                                    0x0300U                                                        /*!<PD[2] pin */
#define SYSCFG_EINTCFG1_EINT2_PE                                    0x0400U                                                        /*!<PE[2] pin */
#define SYSCFG_EINTCFG1_EINT2_PF                                    0x0500U                                                        /*!<PF[2] pin */
#define SYSCFG_EINTCFG1_EINT2_PG                                    0x0600U                                                        /*!<PG[2] pin */
#define SYSCFG_EINTCFG1_EINT2_PH                                    0x0700U                                                        /*!<PH[2] pin */
#define SYSCFG_EINTCFG1_EINT2_PI                                    0x0800U                                                        /*!<PI[2] pin */

/**
  * @brief   EINT3 configuration
  */
#define SYSCFG_EINTCFG1_EINT3_PA                                    0x0000U                                                        /*!<PA[3] pin */
#define SYSCFG_EINTCFG1_EINT3_PB                                    0x1000U                                                        /*!<PB[3] pin */
#define SYSCFG_EINTCFG1_EINT3_PC                                    0x2000U                                                        /*!<PC[3] pin */
#define SYSCFG_EINTCFG1_EINT3_PD                                    0x3000U                                                        /*!<PD[3] pin */
#define SYSCFG_EINTCFG1_EINT3_PE                                    0x4000U                                                        /*!<PE[3] pin */
#define SYSCFG_EINTCFG1_EINT3_PF                                    0x5000U                                                        /*!<PF[3] pin */
#define SYSCFG_EINTCFG1_EINT3_PG                                    0x6000U                                                        /*!<PG[3] pin */
#define SYSCFG_EINTCFG1_EINT3_PH                                    0x7000U                                                        /*!<PH[3] pin */
#define SYSCFG_EINTCFG1_EINT3_PI                                    0x8000U                                                        /*!<PI[3] pin */

/*****************  Bit definition for SYSCFG_EINTCFG2 register  ***************/
#define SYSCFG_EINTCFG2_EINT4_Pos                                   (0U)
#define SYSCFG_EINTCFG2_EINT4_Msk                                   (0xFUL << SYSCFG_EINTCFG2_EINT4_Pos)                           /*!< 0x0000000F */
#define SYSCFG_EINTCFG2_EINT4                                       SYSCFG_EINTCFG2_EINT4_Msk                                      /*!<EINT 4 configuration */
#define SYSCFG_EINTCFG2_EINT5_Pos                                   (4U)
#define SYSCFG_EINTCFG2_EINT5_Msk                                   (0xFUL << SYSCFG_EINTCFG2_EINT5_Pos)                           /*!< 0x000000F0 */
#define SYSCFG_EINTCFG2_EINT5                                       SYSCFG_EINTCFG2_EINT5_Msk                                      /*!<EINT 5 configuration */
#define SYSCFG_EINTCFG2_EINT6_Pos                                   (8U)
#define SYSCFG_EINTCFG2_EINT6_Msk                                   (0xFUL << SYSCFG_EINTCFG2_EINT6_Pos)                           /*!< 0x00000F00 */
#define SYSCFG_EINTCFG2_EINT6                                       SYSCFG_EINTCFG2_EINT6_Msk                                      /*!<EINT 6 configuration */
#define SYSCFG_EINTCFG2_EINT7_Pos                                   (12U)
#define SYSCFG_EINTCFG2_EINT7_Msk                                   (0xFUL << SYSCFG_EINTCFG2_EINT7_Pos)                           /*!< 0x0000F000 */
#define SYSCFG_EINTCFG2_EINT7                                       SYSCFG_EINTCFG2_EINT7_Msk                                      /*!<EINT 7 configuration */

/**
  * @brief   EINT4 configuration
  */
#define SYSCFG_EINTCFG2_EINT4_PA                                    0x0000U                                                        /*!<PA[4] pin */
#define SYSCFG_EINTCFG2_EINT4_PB                                    0x0001U                                                        /*!<PB[4] pin */
#define SYSCFG_EINTCFG2_EINT4_PC                                    0x0002U                                                        /*!<PC[4] pin */
#define SYSCFG_EINTCFG2_EINT4_PD                                    0x0003U                                                        /*!<PD[4] pin */
#define SYSCFG_EINTCFG2_EINT4_PE                                    0x0004U                                                        /*!<PE[4] pin */
#define SYSCFG_EINTCFG2_EINT4_PF                                    0x0005U                                                        /*!<PF[4] pin */
#define SYSCFG_EINTCFG2_EINT4_PG                                    0x0006U                                                        /*!<PG[4] pin */
#define SYSCFG_EINTCFG2_EINT4_PH                                    0x0007U                                                        /*!<PH[4] pin */
#define SYSCFG_EINTCFG2_EINT4_PI                                    0x0008U                                                        /*!<PI[4] pin */

/**
  * @brief   EINT5 configuration
  */
#define SYSCFG_EINTCFG2_EINT5_PA                                    0x0000U                                                        /*!<PA[5] pin */
#define SYSCFG_EINTCFG2_EINT5_PB                                    0x0010U                                                        /*!<PB[5] pin */
#define SYSCFG_EINTCFG2_EINT5_PC                                    0x0020U                                                        /*!<PC[5] pin */
#define SYSCFG_EINTCFG2_EINT5_PD                                    0x0030U                                                        /*!<PD[5] pin */
#define SYSCFG_EINTCFG2_EINT5_PE                                    0x0040U                                                        /*!<PE[5] pin */
#define SYSCFG_EINTCFG2_EINT5_PF                                    0x0050U                                                        /*!<PF[5] pin */
#define SYSCFG_EINTCFG2_EINT5_PG                                    0x0060U                                                        /*!<PG[5] pin */
#define SYSCFG_EINTCFG2_EINT5_PH                                    0x0070U                                                        /*!<PH[5] pin */
#define SYSCFG_EINTCFG2_EINT5_PI                                    0x0080U                                                        /*!<PI[5] pin */

/**
  * @brief   EINT6 configuration
  */
#define SYSCFG_EINTCFG2_EINT6_PA                                    0x0000U                                                        /*!<PA[6] pin */
#define SYSCFG_EINTCFG2_EINT6_PB                                    0x0100U                                                        /*!<PB[6] pin */
#define SYSCFG_EINTCFG2_EINT6_PC                                    0x0200U                                                        /*!<PC[6] pin */
#define SYSCFG_EINTCFG2_EINT6_PD                                    0x0300U                                                        /*!<PD[6] pin */
#define SYSCFG_EINTCFG2_EINT6_PE                                    0x0400U                                                        /*!<PE[6] pin */
#define SYSCFG_EINTCFG2_EINT6_PF                                    0x0500U                                                        /*!<PF[6] pin */
#define SYSCFG_EINTCFG2_EINT6_PG                                    0x0600U                                                        /*!<PG[6] pin */
#define SYSCFG_EINTCFG2_EINT6_PH                                    0x0700U                                                        /*!<PH[6] pin */
#define SYSCFG_EINTCFG2_EINT6_PI                                    0x0800U                                                        /*!<PI[6] pin */

/**
  * @brief   EINT7 configuration
  */
#define SYSCFG_EINTCFG2_EINT7_PA                                    0x0000U                                                        /*!<PA[7] pin */
#define SYSCFG_EINTCFG2_EINT7_PB                                    0x1000U                                                        /*!<PB[7] pin */
#define SYSCFG_EINTCFG2_EINT7_PC                                    0x2000U                                                        /*!<PC[7] pin */
#define SYSCFG_EINTCFG2_EINT7_PD                                    0x3000U                                                        /*!<PD[7] pin */
#define SYSCFG_EINTCFG2_EINT7_PE                                    0x4000U                                                        /*!<PE[7] pin */
#define SYSCFG_EINTCFG2_EINT7_PF                                    0x5000U                                                        /*!<PF[7] pin */
#define SYSCFG_EINTCFG2_EINT7_PG                                    0x6000U                                                        /*!<PG[7] pin */
#define SYSCFG_EINTCFG2_EINT7_PH                                    0x7000U                                                        /*!<PH[7] pin */
#define SYSCFG_EINTCFG2_EINT7_PI                                    0x8000U                                                        /*!<PI[7] pin */

