betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
#define TMR_CTRL2_MMSEL_Pos                                         (4U)
#define TMR_CTRL2_MMSEL_Msk                                         (0x7UL << TMR_CTRL2_MMSEL_Pos)                                 /*!< 0x00000070 */
#define TMR_CTRL2_MMSEL                                             TMR_CTRL2_MMSEL_Msk                                            /*!<MMS[2:0] bits (Master Mode Selection) */
#define TMR_CTRL2_MMSEL_0                                           (0x1UL << TMR_CTRL2_MMSEL_Pos)                                 /*!< 0x0010 */
#define TMR_CTRL2_MMSEL_1                                           (0x2UL << TMR_CTRL2_MMSEL_Pos)                                 /*!< 0x0020 */
#define TMR_CTRL2_MMSEL_2                                           (0x4UL << TMR_CTRL2_MMSEL_Pos)                                 /*!< 0x0040 */

#define TMR_CTRL2_TI1SEL_Pos                                        (7U)
#define TMR_CTRL2_TI1SEL_Msk                                        (0x1UL << TMR_CTRL2_TI1SEL_Pos)                                /*!< 0x00000080 */
#define TMR_CTRL2_TI1SEL                                            TMR_CTRL2_TI1SEL_Msk                                           /*!<TI1 Selection */
#define TMR_CTRL2_OC1OIS_Pos                                        (8U)
#define TMR_CTRL2_OC1OIS_Msk                                        (0x1UL << TMR_CTRL2_OC1OIS_Pos)                                /*!< 0x00000100 */
#define TMR_CTRL2_OC1OIS                                            TMR_CTRL2_OC1OIS_Msk                                           /*!<Output Idle state 1 (OC1 output)  */
#define TMR_CTRL2_OC1NOIS_Pos                                       (9U)
#define TMR_CTRL2_OC1NOIS_Msk                                       (0x1UL << TMR_CTRL2_OC1NOIS_Pos)                               /*!< 0x00000200 */
#define TMR_CTRL2_OC1NOIS                                           TMR_CTRL2_OC1NOIS_Msk                                          /*!<Output Idle state 1 (OC1N output) */
#define TMR_CTRL2_OC2OIS_Pos                                        (10U)
#define TMR_CTRL2_OC2OIS_Msk                                        (0x1UL << TMR_CTRL2_OC2OIS_Pos)                                /*!< 0x00000400 */
#define TMR_CTRL2_OC2OIS                                            TMR_CTRL2_OC2OIS_Msk                                           /*!<Output Idle state 2 (OC2 output)  */
#define TMR_CTRL2_OC2NOIS_Pos                                       (11U)
#define TMR_CTRL2_OC2NOIS_Msk                                       (0x1UL << TMR_CTRL2_OC2NOIS_Pos)                               /*!< 0x00000800 */
#define TMR_CTRL2_OC2NOIS                                           TMR_CTRL2_OC2NOIS_Msk                                          /*!<Output Idle state 2 (OC2N output) */
#define TMR_CTRL2_OC3OIS_Pos                                        (12U)
#define TMR_CTRL2_OC3OIS_Msk                                        (0x1UL << TMR_CTRL2_OC3OIS_Pos)                                /*!< 0x00001000 */
#define TMR_CTRL2_OC3OIS                                            TMR_CTRL2_OC3OIS_Msk                                           /*!<Output Idle state 3 (OC3 output)  */
#define TMR_CTRL2_OC3NOIS_Pos                                       (13U)
#define TMR_CTRL2_OC3NOIS_Msk                                       (0x1UL << TMR_CTRL2_OC3NOIS_Pos)                               /*!< 0x00002000 */
#define TMR_CTRL2_OC3NOIS                                           TMR_CTRL2_OC3NOIS_Msk                                          /*!<Output Idle state 3 (OC3N output) */
#define TMR_CTRL2_OC4OIS_Pos                                        (14U)
#define TMR_CTRL2_OC4OIS_Msk                                        (0x1UL << TMR_CTRL2_OC4OIS_Pos)                                /*!< 0x00004000 */
#define TMR_CTRL2_OC4OIS                                            TMR_CTRL2_OC4OIS_Msk                                           /*!<Output Idle state 4 (OC4 output)  */

/*******************  Bit definition for TMR_SMCTRL register  *******************/
#define TMR_SMCTRL_SMFSEL_Pos                                       (0U)
#define TMR_SMCTRL_SMFSEL_Msk                                       (0x7UL << TMR_SMCTRL_SMFSEL_Pos)                               /*!< 0x00000007 */
#define TMR_SMCTRL_SMFSEL                                           TMR_SMCTRL_SMFSEL_Msk                                          /*!<SMS[2:0] bits (Slave mode selection)    */
#define TMR_SMCTRL_SMFSEL_0                                         (0x1UL << TMR_SMCTRL_SMFSEL_Pos)                               /*!< 0x0001 */
#define TMR_SMCTRL_SMFSEL_1                                         (0x2UL << TMR_SMCTRL_SMFSEL_Pos)                               /*!< 0x0002 */
#define TMR_SMCTRL_SMFSEL_2                                         (0x4UL << TMR_SMCTRL_SMFSEL_Pos)                               /*!< 0x0004 */

#define TMR_SMCTRL_TRGSEL_Pos                                       (4U)
#define TMR_SMCTRL_TRGSEL_Msk                                       (0x7UL << TMR_SMCTRL_TRGSEL_Pos)                               /*!< 0x00000070 */
#define TMR_SMCTRL_TRGSEL                                           TMR_SMCTRL_TRGSEL_Msk                                          /*!<TS[2:0] bits (Trigger selection)        */
#define TMR_SMCTRL_TRGSEL_0                                         (0x1UL << TMR_SMCTRL_TRGSEL_Pos)                               /*!< 0x0010 */
#define TMR_SMCTRL_TRGSEL_1                                         (0x2UL << TMR_SMCTRL_TRGSEL_Pos)                               /*!< 0x0020 */
#define TMR_SMCTRL_TRGSEL_2                                         (0x4UL << TMR_SMCTRL_TRGSEL_Pos)                               /*!< 0x0040 */

#define TMR_SMCTRL_MSMEN_Pos                                        (7U)
#define TMR_SMCTRL_MSMEN_Msk                                        (0x1UL << TMR_SMCTRL_MSMEN_Pos)                                /*!< 0x00000080 */
#define TMR_SMCTRL_MSMEN                                            TMR_SMCTRL_MSMEN_Msk                                           /*!<Master/slave mode                       */

