betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f465xx.h
/********************  Bit definition for DBGMCU_APB2_FZ register  ************/
#define DBGMCU_APB2F_TMR1_STS_Pos                                   (0U)
#define DBGMCU_APB2F_TMR1_STS_Msk                                   (0x1UL << DBGMCU_APB2F_TMR1_STS_Pos)                           /*!< 0x00000001 */
#define DBGMCU_APB2F_TMR1_STS                                       DBGMCU_APB2F_TMR1_STS_Msk
#define DBGMCU_APB2F_TMR8_STS_Pos                                   (1U)
#define DBGMCU_APB2F_TMR8_STS_Msk                                   (0x1UL << DBGMCU_APB2F_TMR8_STS_Pos)                           /*!< 0x00000002 */
#define DBGMCU_APB2F_TMR8_STS                                       DBGMCU_APB2F_TMR8_STS_Msk
#define DBGMCU_APB2F_TMR9_STS_Pos                                   (16U)
#define DBGMCU_APB2F_TMR9_STS_Msk                                   (0x1UL << DBGMCU_APB2F_TMR9_STS_Pos)                           /*!< 0x00010000 */
#define DBGMCU_APB2F_TMR9_STS                                       DBGMCU_APB2F_TMR9_STS_Msk
#define DBGMCU_APB2F_TMR10_STS_Pos                                  (17U)
#define DBGMCU_APB2F_TMR10_STS_Msk                                  (0x1UL << DBGMCU_APB2F_TMR10_STS_Pos)                          /*!< 0x00020000 */
#define DBGMCU_APB2F_TMR10_STS                                      DBGMCU_APB2F_TMR10_STS_Msk
#define DBGMCU_APB2F_TMR11_STS_Pos                                  (18U)
#define DBGMCU_APB2F_TMR11_STS_Msk                                  (0x1UL << DBGMCU_APB2F_TMR11_STS_Pos)                          /*!< 0x00040000 */
#define DBGMCU_APB2F_TMR11_STS                                      DBGMCU_APB2F_TMR11_STS_Msk

/******************************************************************************/
/*                                                                            */
/*                                       USB_OTG                              */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for USB_OTG_GCTRLSTS register  ***********/
#define USB_OTG_GCTRLSTS_SREQSUC_Pos                                (0U)
#define USB_OTG_GCTRLSTS_SREQSUC_Msk                                (0x1UL << USB_OTG_GCTRLSTS_SREQSUC_Pos)                        /*!< 0x00000001 */
#define USB_OTG_GCTRLSTS_SREQSUC                                    USB_OTG_GCTRLSTS_SREQSUC_Msk                                   /*!< Session request success */
#define USB_OTG_GCTRLSTS_SREQ_Pos                                   (1U)
#define USB_OTG_GCTRLSTS_SREQ_Msk                                   (0x1UL << USB_OTG_GCTRLSTS_SREQ_Pos)                           /*!< 0x00000002 */
#define USB_OTG_GCTRLSTS_SREQ                                       USB_OTG_GCTRLSTS_SREQ_Msk                                      /*!< Session request */
#define USB_OTG_GCTRLSTS_HNSUC_Pos                                  (8U)
#define USB_OTG_GCTRLSTS_HNSUC_Msk                                  (0x1UL << USB_OTG_GCTRLSTS_HNSUC_Pos)                          /*!< 0x00000100 */
#define USB_OTG_GCTRLSTS_HNSUC                                      USB_OTG_GCTRLSTS_HNSUC_Msk                                     /*!< Host set HNP enable */
#define USB_OTG_GCTRLSTS_HNPREQ_Pos                                 (9U)
#define USB_OTG_GCTRLSTS_HNPREQ_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_HNPREQ_Pos)                         /*!< 0x00000200 */
#define USB_OTG_GCTRLSTS_HNPREQ                                     USB_OTG_GCTRLSTS_HNPREQ_Msk                                    /*!< HNP request */
#define USB_OTG_GCTRLSTS_HHNPEN_Pos                                 (10U)
#define USB_OTG_GCTRLSTS_HHNPEN_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_HHNPEN_Pos)                         /*!< 0x00000400 */
#define USB_OTG_GCTRLSTS_HHNPEN                                     USB_OTG_GCTRLSTS_HHNPEN_Msk                                    /*!< Host set HNP enable */
#define USB_OTG_GCTRLSTS_DHNPEN_Pos                                 (11U)
#define USB_OTG_GCTRLSTS_DHNPEN_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_DHNPEN_Pos)                         /*!< 0x00000800 */
#define USB_OTG_GCTRLSTS_DHNPEN                                     USB_OTG_GCTRLSTS_DHNPEN_Msk                                    /*!< Device HNP enabled */
#define USB_OTG_GCTRLSTS_CIDSTS_Pos                                 (16U)
#define USB_OTG_GCTRLSTS_CIDSTS_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_CIDSTS_Pos)                         /*!< 0x00010000 */
#define USB_OTG_GCTRLSTS_CIDSTS                                     USB_OTG_GCTRLSTS_CIDSTS_Msk                                    /*!< Connector ID status */
#define USB_OTG_GCTRLSTS_LSDEBT_Pos                                 (17U)
#define USB_OTG_GCTRLSTS_LSDEBT_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_LSDEBT_Pos)                         /*!< 0x00020000 */
#define USB_OTG_GCTRLSTS_LSDEBT                                     USB_OTG_GCTRLSTS_LSDEBT_Msk                                    /*!< Long/short debounce time */
#define USB_OTG_GCTRLSTS_ASVD_Pos                                   (18U)
#define USB_OTG_GCTRLSTS_ASVD_Msk                                   (0x1UL << USB_OTG_GCTRLSTS_ASVD_Pos)                           /*!< 0x00040000 */
#define USB_OTG_GCTRLSTS_ASVD                                       USB_OTG_GCTRLSTS_ASVD_Msk                                      /*!< A-session valid  */
#define USB_OTG_GCTRLSTS_BSVD_Pos                                   (19U)
#define USB_OTG_GCTRLSTS_BSVD_Msk                                   (0x1UL << USB_OTG_GCTRLSTS_BSVD_Pos)                           /*!< 0x00080000 */
#define USB_OTG_GCTRLSTS_BSVD                                       USB_OTG_GCTRLSTS_BSVD_Msk                                      /*!< B-session valid */

/********************  Bit definition for USB_OTG_HCFG register  ********************/

#define USB_OTG_HCFG_PHYCLKSEL_Pos                                  (0U)
#define USB_OTG_HCFG_PHYCLKSEL_Msk                                  (0x3UL << USB_OTG_HCFG_PHYCLKSEL_Pos)                          /*!< 0x00000003 */
#define USB_OTG_HCFG_PHYCLKSEL                                      USB_OTG_HCFG_PHYCLKSEL_Msk                                     /*!< FS/LS PHY clock select  */
#define USB_OTG_HCFG_PHYCLKSEL_0                                    (0x1UL << USB_OTG_HCFG_PHYCLKSEL_Pos)                          /*!< 0x00000001 */
#define USB_OTG_HCFG_PHYCLKSEL_1                                    (0x2UL << USB_OTG_HCFG_PHYCLKSEL_Pos)                          /*!< 0x00000002 */
#define USB_OTG_HCFG_FSSPT_Pos                                      (2U)
#define USB_OTG_HCFG_FSSPT_Msk                                      (0x1UL << USB_OTG_HCFG_FSSPT_Pos)                              /*!< 0x00000004 */
#define USB_OTG_HCFG_FSSPT                                          USB_OTG_HCFG_FSSPT_Msk                                         /*!< FS- and LS-only support */

/********************  Bit definition for USB_OTG_DCFG register  ********************/

#define USB_OTG_DCFG_DSPDSEL_Pos                                    (0U)
#define USB_OTG_DCFG_DSPDSEL_Msk                                    (0x3UL << USB_OTG_DCFG_DSPDSEL_Pos)                            /*!< 0x00000003 */
#define USB_OTG_DCFG_DSPDSEL                                        USB_OTG_DCFG_DSPDSEL_Msk                                       /*!< Device speed */
#define USB_OTG_DCFG_DSPDSEL_0                                      (0x1UL << USB_OTG_DCFG_DSPDSEL_Pos)                            /*!< 0x00000001 */
#define USB_OTG_DCFG_DSPDSEL_1                                      (0x2UL << USB_OTG_DCFG_DSPDSEL_Pos)                            /*!< 0x00000002 */
#define USB_OTG_DCFG_SENDOUT_Pos                                    (2U)
#define USB_OTG_DCFG_SENDOUT_Msk                                    (0x1UL << USB_OTG_DCFG_SENDOUT_Pos)                            /*!< 0x00000004 */
#define USB_OTG_DCFG_SENDOUT                                        USB_OTG_DCFG_SENDOUT_Msk                                       /*!< Nonzero-length status OUT handshake */

#define USB_OTG_DCFG_DADDR_Pos                                      (4U)
#define USB_OTG_DCFG_DADDR_Msk                                      (0x7FUL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x000007F0 */
#define USB_OTG_DCFG_DADDR                                          USB_OTG_DCFG_DADDR_Msk                                         /*!< Device address */
#define USB_OTG_DCFG_DADDR_0                                        (0x01UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000010 */
#define USB_OTG_DCFG_DADDR_1                                        (0x02UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000020 */
#define USB_OTG_DCFG_DADDR_2                                        (0x04UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000040 */
#define USB_OTG_DCFG_DADDR_3                                        (0x08UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000080 */
#define USB_OTG_DCFG_DADDR_4                                        (0x10UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000100 */
#define USB_OTG_DCFG_DADDR_5                                        (0x20UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000200 */
#define USB_OTG_DCFG_DADDR_6                                        (0x40UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000400 */

#define USB_OTG_DCFG_PFITV_Pos                                      (11U)
#define USB_OTG_DCFG_PFITV_Msk                                      (0x3UL << USB_OTG_DCFG_PFITV_Pos)                              /*!< 0x00001800 */
#define USB_OTG_DCFG_PFITV                                          USB_OTG_DCFG_PFITV_Msk                                         /*!< Periodic (micro)frame interval */
#define USB_OTG_DCFG_PFITV_0                                        (0x1UL << USB_OTG_DCFG_PFITV_Pos)                              /*!< 0x00000800 */
#define USB_OTG_DCFG_PFITV_1                                        (0x2UL << USB_OTG_DCFG_PFITV_Pos)                              /*!< 0x00001000 */

#define USB_OTG_DCFG_XCVRDLY_Pos                                    (14U)
#define USB_OTG_DCFG_XCVRDLY_Msk                                    (0x1UL << USB_OTG_DCFG_XCVRDLY_Pos)                            /*!< 0x00004000 */
#define USB_OTG_DCFG_XCVRDLY                                        USB_OTG_DCFG_XCVRDLY_Msk                                       /*!< Transceiver delay */

#define USB_OTG_DCFG_ERRATMR_Pos                                    (15U)
#define USB_OTG_DCFG_ERRATMR_Msk                                    (0x1UL << USB_OTG_DCFG_ERRATMR_Pos)                            /*!< 0x00008000 */
#define USB_OTG_DCFG_ERRATMR                                        USB_OTG_DCFG_ERRATMR_Msk                                       /*!< Erratic error interrupt mask */

#define USB_OTG_DCFG_PSITV_Pos                                      (24U)
#define USB_OTG_DCFG_PSITV_Msk                                      (0x3UL << USB_OTG_DCFG_PSITV_Pos)                              /*!< 0x03000000 */
#define USB_OTG_DCFG_PSITV                                          USB_OTG_DCFG_PSITV_Msk                                         /*!< Periodic scheduling interval */
#define USB_OTG_DCFG_PSITV_0                                        (0x1UL << USB_OTG_DCFG_PSITV_Pos)                              /*!< 0x01000000 */
#define USB_OTG_DCFG_PSITV_1                                        (0x2UL << USB_OTG_DCFG_PSITV_Pos)                              /*!< 0x02000000 */

/********************  Bit definition for USB_OTG_PCGCCTL register  ********************/
#define USB_OTG_PCGCCTL_PCLKSTOP_Pos                                (0U)
#define USB_OTG_PCGCCTL_PCLKSTOP_Msk                                (0x1UL << USB_OTG_PCGCCTL_PCLKSTOP_Pos)                        /*!< 0x00000001 */
#define USB_OTG_PCGCCTL_PCLKSTOP                                    USB_OTG_PCGCCTL_PCLKSTOP_Msk                                   /*!< Stop PHY clock */
#define USB_OTG_PCGCCTL_GCLK_Pos                                    (1U)
#define USB_OTG_PCGCCTL_GCLK_Msk                                    (0x1UL << USB_OTG_PCGCCTL_GCLK_Pos)                            /*!< 0x00000002 */
#define USB_OTG_PCGCCTL_GCLK                                        USB_OTG_PCGCCTL_GCLK_Msk                                       /*!< Gate HCLK */
#define USB_OTG_PCGCR_PHYSUS_Pos                                    (4U)
#define USB_OTG_PCGCR_PHYSUS_Msk                                    (0x1UL << USB_OTG_PCGCR_PHYSUS_Pos)                            /*!< 0x00000010 */
#define USB_OTG_PCGCR_PHYSUS                                        USB_OTG_PCGCR_PHYSUS_Msk                                       /*!< PHY suspended */

/********************  Bit definition for USB_OTG_GINT register  ********************/
#define USB_OTG_GINT_SEFLG_Pos                                      (2U)
#define USB_OTG_GINT_SEFLG_Msk                                      (0x1UL << USB_OTG_GINT_SEFLG_Pos)                              /*!< 0x00000004 */
#define USB_OTG_GINT_SEFLG                                          USB_OTG_GINT_SEFLG_Msk                                         /*!< Session end detected                   */
#define USB_OTG_GINT_SREQSUCCHG_Pos                                 (8U)
#define USB_OTG_GINT_SREQSUCCHG_Msk                                 (0x1UL << USB_OTG_GINT_SREQSUCCHG_Pos)                         /*!< 0x00000100 */
#define USB_OTG_GINT_SREQSUCCHG                                     USB_OTG_GINT_SREQSUCCHG_Msk                                    /*!< Session request success status change  */
#define USB_OTG_GINT_HNSUCCHG_Pos                                   (9U)
#define USB_OTG_GINT_HNSUCCHG_Msk                                   (0x1UL << USB_OTG_GINT_HNSUCCHG_Pos)                           /*!< 0x00000200 */
#define USB_OTG_GINT_HNSUCCHG                                       USB_OTG_GINT_HNSUCCHG_Msk                                      /*!< Host negotiation success status change */
#define USB_OTG_GINT_HNFLG_Pos                                      (17U)
#define USB_OTG_GINT_HNFLG_Msk                                      (0x1UL << USB_OTG_GINT_HNFLG_Pos)                              /*!< 0x00020000 */
#define USB_OTG_GINT_HNFLG                                          USB_OTG_GINT_HNFLG_Msk                                         /*!< Host negotiation detected              */
#define USB_OTG_GINT_ADTOFLG_Pos                                    (18U)
#define USB_OTG_GINT_ADTOFLG_Msk                                    (0x1UL << USB_OTG_GINT_ADTOFLG_Pos)                            /*!< 0x00040000 */
#define USB_OTG_GINT_ADTOFLG                                        USB_OTG_GINT_ADTOFLG_Msk                                       /*!< A-device timeout change                */
#define USB_OTG_GINT_DEBDFLG_Pos                                    (19U)
#define USB_OTG_GINT_DEBDFLG_Msk                                    (0x1UL << USB_OTG_GINT_DEBDFLG_Pos)                            /*!< 0x00080000 */
#define USB_OTG_GINT_DEBDFLG                                        USB_OTG_GINT_DEBDFLG_Msk                                       /*!< Debounce done                          */

/********************  Bit definition for USB_OTG_DCTRL register  ********************/
#define USB_OTG_DCTRL_RWKUPS_Pos                                    (0U)
#define USB_OTG_DCTRL_RWKUPS_Msk                                    (0x1UL << USB_OTG_DCTRL_RWKUPS_Pos)                            /*!< 0x00000001 */
#define USB_OTG_DCTRL_RWKUPS                                        USB_OTG_DCTRL_RWKUPS_Msk                                       /*!< Remote wakeup signaling */
#define USB_OTG_DCTRL_SDCNNT_Pos                                    (1U)
#define USB_OTG_DCTRL_SDCNNT_Msk                                    (0x1UL << USB_OTG_DCTRL_SDCNNT_Pos)                            /*!< 0x00000002 */
#define USB_OTG_DCTRL_SDCNNT                                        USB_OTG_DCTRL_SDCNNT_Msk                                       /*!< Soft disconnect         */
#define USB_OTG_DCTRL_GINAKSTS_Pos                                  (2U)
#define USB_OTG_DCTRL_GINAKSTS_Msk                                  (0x1UL << USB_OTG_DCTRL_GINAKSTS_Pos)                          /*!< 0x00000004 */
#define USB_OTG_DCTRL_GINAKSTS                                      USB_OTG_DCTRL_GINAKSTS_Msk                                     /*!< Global IN NAK status    */
#define USB_OTG_DCTRL_GONAKSTS_Pos                                  (3U)
#define USB_OTG_DCTRL_GONAKSTS_Msk                                  (0x1UL << USB_OTG_DCTRL_GONAKSTS_Pos)                          /*!< 0x00000008 */
#define USB_OTG_DCTRL_GONAKSTS                                      USB_OTG_DCTRL_GONAKSTS_Msk                                     /*!< Global OUT NAK status   */

#define USB_OTG_DCTRL_TESTSEL_Pos                                   (4U)
#define USB_OTG_DCTRL_TESTSEL_Msk                                   (0x7UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000070 */
#define USB_OTG_DCTRL_TESTSEL                                       USB_OTG_DCTRL_TESTSEL_Msk                                      /*!< Test control */
#define USB_OTG_DCTRL_TESTSEL_0                                     (0x1UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000010 */
#define USB_OTG_DCTRL_TESTSEL_1                                     (0x2UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000020 */
#define USB_OTG_DCTRL_TESTSEL_2                                     (0x4UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000040 */
#define USB_OTG_DCTRL_GINAKSET_Pos                                  (7U)
#define USB_OTG_DCTRL_GINAKSET_Msk                                  (0x1UL << USB_OTG_DCTRL_GINAKSET_Pos)                          /*!< 0x00000080 */
#define USB_OTG_DCTRL_GINAKSET                                      USB_OTG_DCTRL_GINAKSET_Msk                                     /*!< Set global IN NAK         */
#define USB_OTG_DCTRL_GINAKCLR_Pos                                  (8U)
#define USB_OTG_DCTRL_GINAKCLR_Msk                                  (0x1UL << USB_OTG_DCTRL_GINAKCLR_Pos)                          /*!< 0x00000100 */
#define USB_OTG_DCTRL_GINAKCLR                                      USB_OTG_DCTRL_GINAKCLR_Msk                                     /*!< Clear global IN NAK       */
#define USB_OTG_DCTRL_GONAKSET_Pos                                  (9U)
#define USB_OTG_DCTRL_GONAKSET_Msk                                  (0x1UL << USB_OTG_DCTRL_GONAKSET_Pos)                          /*!< 0x00000200 */
#define USB_OTG_DCTRL_GONAKSET                                      USB_OTG_DCTRL_GONAKSET_Msk                                     /*!< Set global OUT NAK        */
#define USB_OTG_DCTRL_GONAKCLR_Pos                                  (10U)
#define USB_OTG_DCTRL_GONAKCLR_Msk                                  (0x1UL << USB_OTG_DCTRL_GONAKCLR_Pos)                          /*!< 0x00000400 */
#define USB_OTG_DCTRL_GONAKCLR                                      USB_OTG_DCTRL_GONAKCLR_Msk                                     /*!< Clear global OUT NAK      */
#define USB_OTG_DCTRL_POPROGCMP_Pos                                 (11U)
#define USB_OTG_DCTRL_POPROGCMP_Msk                                 (0x1UL << USB_OTG_DCTRL_POPROGCMP_Pos)                         /*!< 0x00000800 */
#define USB_OTG_DCTRL_POPROGCMP                                     USB_OTG_DCTRL_POPROGCMP_Msk                                    /*!< Power-on programming done */

